ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157fxx_ca7.h
/*****************  Bit definition for DDRPHYC_PTR0 register  *****************/
#define DDRPHYC_PTR0_TDLLSRST_Pos (0U)
#define DDRPHYC_PTR0_TDLLSRST_Msk (0x3FU << DDRPHYC_PTR0_TDLLSRST_Pos)  /*!< 0x0000003F */
#define DDRPHYC_PTR0_TDLLSRST     DDRPHYC_PTR0_TDLLSRST_Msk             /*!< DLL soft reset */
#define DDRPHYC_PTR0_TDLLSRST_0   (0x1U << DDRPHYC_PTR0_TDLLSRST_Pos)   /*!< 0x00000001 */
#define DDRPHYC_PTR0_TDLLSRST_1   (0x2U << DDRPHYC_PTR0_TDLLSRST_Pos)   /*!< 0x00000002 */
#define DDRPHYC_PTR0_TDLLSRST_2   (0x4U << DDRPHYC_PTR0_TDLLSRST_Pos)   /*!< 0x00000004 */
#define DDRPHYC_PTR0_TDLLSRST_3   (0x8U << DDRPHYC_PTR0_TDLLSRST_Pos)   /*!< 0x00000008 */
#define DDRPHYC_PTR0_TDLLSRST_4   (0x10U << DDRPHYC_PTR0_TDLLSRST_Pos)  /*!< 0x00000010 */
#define DDRPHYC_PTR0_TDLLSRST_5   (0x20U << DDRPHYC_PTR0_TDLLSRST_Pos)  /*!< 0x00000020 */
#define DDRPHYC_PTR0_TDLLLOCK_Pos (6U)
#define DDRPHYC_PTR0_TDLLLOCK_Msk (0xFFFU << DDRPHYC_PTR0_TDLLLOCK_Pos) /*!< 0x0003FFC0 */
#define DDRPHYC_PTR0_TDLLLOCK     DDRPHYC_PTR0_TDLLLOCK_Msk             /*!< DLL lock time */
#define DDRPHYC_PTR0_TDLLLOCK_0   (0x1U << DDRPHYC_PTR0_TDLLLOCK_Pos)   /*!< 0x00000040 */
#define DDRPHYC_PTR0_TDLLLOCK_1   (0x2U << DDRPHYC_PTR0_TDLLLOCK_Pos)   /*!< 0x00000080 */
#define DDRPHYC_PTR0_TDLLLOCK_2   (0x4U << DDRPHYC_PTR0_TDLLLOCK_Pos)   /*!< 0x00000100 */
#define DDRPHYC_PTR0_TDLLLOCK_3   (0x8U << DDRPHYC_PTR0_TDLLLOCK_Pos)   /*!< 0x00000200 */
#define DDRPHYC_PTR0_TDLLLOCK_4   (0x10U << DDRPHYC_PTR0_TDLLLOCK_Pos)  /*!< 0x00000400 */
#define DDRPHYC_PTR0_TDLLLOCK_5   (0x20U << DDRPHYC_PTR0_TDLLLOCK_Pos)  /*!< 0x00000800 */
#define DDRPHYC_PTR0_TDLLLOCK_6   (0x40U << DDRPHYC_PTR0_TDLLLOCK_Pos)  /*!< 0x00001000 */
#define DDRPHYC_PTR0_TDLLLOCK_7   (0x80U << DDRPHYC_PTR0_TDLLLOCK_Pos)  /*!< 0x00002000 */
#define DDRPHYC_PTR0_TDLLLOCK_8   (0x100U << DDRPHYC_PTR0_TDLLLOCK_Pos) /*!< 0x00004000 */
#define DDRPHYC_PTR0_TDLLLOCK_9   (0x200U << DDRPHYC_PTR0_TDLLLOCK_Pos) /*!< 0x00008000 */
#define DDRPHYC_PTR0_TDLLLOCK_10  (0x400U << DDRPHYC_PTR0_TDLLLOCK_Pos) /*!< 0x00010000 */
#define DDRPHYC_PTR0_TDLLLOCK_11  (0x800U << DDRPHYC_PTR0_TDLLLOCK_Pos) /*!< 0x00020000 */
#define DDRPHYC_PTR0_TITMSRST_Pos (18U)
#define DDRPHYC_PTR0_TITMSRST_Msk (0xFU << DDRPHYC_PTR0_TITMSRST_Pos)   /*!< 0x003C0000 */
#define DDRPHYC_PTR0_TITMSRST     DDRPHYC_PTR0_TITMSRST_Msk             /*!< ITM soft reset */
#define DDRPHYC_PTR0_TITMSRST_0   (0x1U << DDRPHYC_PTR0_TITMSRST_Pos)   /*!< 0x00040000 */
#define DDRPHYC_PTR0_TITMSRST_1   (0x2U << DDRPHYC_PTR0_TITMSRST_Pos)   /*!< 0x00080000 */
#define DDRPHYC_PTR0_TITMSRST_2   (0x4U << DDRPHYC_PTR0_TITMSRST_Pos)   /*!< 0x00100000 */
#define DDRPHYC_PTR0_TITMSRST_3   (0x8U << DDRPHYC_PTR0_TITMSRST_Pos)   /*!< 0x00200000 */

/*****************  Bit definition for DDRPHYC_PTR1 register  *****************/
#define DDRPHYC_PTR1_TDINIT0_Pos (0U)
#define DDRPHYC_PTR1_TDINIT0_Msk (0x7FFFFU << DDRPHYC_PTR1_TDINIT0_Pos) /*!< 0x0007FFFF */
#define DDRPHYC_PTR1_TDINIT0     DDRPHYC_PTR1_TDINIT0_Msk               /*!< tDINIT0 */
#define DDRPHYC_PTR1_TDINIT0_0   (0x1U << DDRPHYC_PTR1_TDINIT0_Pos)     /*!< 0x00000001 */
#define DDRPHYC_PTR1_TDINIT0_1   (0x2U << DDRPHYC_PTR1_TDINIT0_Pos)     /*!< 0x00000002 */
#define DDRPHYC_PTR1_TDINIT0_2   (0x4U << DDRPHYC_PTR1_TDINIT0_Pos)     /*!< 0x00000004 */
#define DDRPHYC_PTR1_TDINIT0_3   (0x8U << DDRPHYC_PTR1_TDINIT0_Pos)     /*!< 0x00000008 */
#define DDRPHYC_PTR1_TDINIT0_4   (0x10U << DDRPHYC_PTR1_TDINIT0_Pos)    /*!< 0x00000010 */
#define DDRPHYC_PTR1_TDINIT0_5   (0x20U << DDRPHYC_PTR1_TDINIT0_Pos)    /*!< 0x00000020 */
#define DDRPHYC_PTR1_TDINIT0_6   (0x40U << DDRPHYC_PTR1_TDINIT0_Pos)    /*!< 0x00000040 */
#define DDRPHYC_PTR1_TDINIT0_7   (0x80U << DDRPHYC_PTR1_TDINIT0_Pos)    /*!< 0x00000080 */
#define DDRPHYC_PTR1_TDINIT0_8   (0x100U << DDRPHYC_PTR1_TDINIT0_Pos)   /*!< 0x00000100 */
#define DDRPHYC_PTR1_TDINIT0_9   (0x200U << DDRPHYC_PTR1_TDINIT0_Pos)   /*!< 0x00000200 */
#define DDRPHYC_PTR1_TDINIT0_10  (0x400U << DDRPHYC_PTR1_TDINIT0_Pos)   /*!< 0x00000400 */
#define DDRPHYC_PTR1_TDINIT0_11  (0x800U << DDRPHYC_PTR1_TDINIT0_Pos)   /*!< 0x00000800 */
#define DDRPHYC_PTR1_TDINIT0_12  (0x1000U << DDRPHYC_PTR1_TDINIT0_Pos)  /*!< 0x00001000 */
#define DDRPHYC_PTR1_TDINIT0_13  (0x2000U << DDRPHYC_PTR1_TDINIT0_Pos)  /*!< 0x00002000 */
#define DDRPHYC_PTR1_TDINIT0_14  (0x4000U << DDRPHYC_PTR1_TDINIT0_Pos)  /*!< 0x00004000 */
#define DDRPHYC_PTR1_TDINIT0_15  (0x8000U << DDRPHYC_PTR1_TDINIT0_Pos)  /*!< 0x00008000 */
#define DDRPHYC_PTR1_TDINIT0_16  (0x10000U << DDRPHYC_PTR1_TDINIT0_Pos) /*!< 0x00010000 */
#define DDRPHYC_PTR1_TDINIT0_17  (0x20000U << DDRPHYC_PTR1_TDINIT0_Pos) /*!< 0x00020000 */
#define DDRPHYC_PTR1_TDINIT0_18  (0x40000U << DDRPHYC_PTR1_TDINIT0_Pos) /*!< 0x00040000 */
#define DDRPHYC_PTR1_TDINIT1_Pos (19U)
#define DDRPHYC_PTR1_TDINIT1_Msk (0xFFU << DDRPHYC_PTR1_TDINIT1_Pos)    /*!< 0x07F80000 */
#define DDRPHYC_PTR1_TDINIT1     DDRPHYC_PTR1_TDINIT1_Msk               /*!< tDINIT1 */
#define DDRPHYC_PTR1_TDINIT1_0   (0x1U << DDRPHYC_PTR1_TDINIT1_Pos)     /*!< 0x00080000 */
#define DDRPHYC_PTR1_TDINIT1_1   (0x2U << DDRPHYC_PTR1_TDINIT1_Pos)     /*!< 0x00100000 */
#define DDRPHYC_PTR1_TDINIT1_2   (0x4U << DDRPHYC_PTR1_TDINIT1_Pos)     /*!< 0x00200000 */
#define DDRPHYC_PTR1_TDINIT1_3   (0x8U << DDRPHYC_PTR1_TDINIT1_Pos)     /*!< 0x00400000 */
#define DDRPHYC_PTR1_TDINIT1_4   (0x10U << DDRPHYC_PTR1_TDINIT1_Pos)    /*!< 0x00800000 */
#define DDRPHYC_PTR1_TDINIT1_5   (0x20U << DDRPHYC_PTR1_TDINIT1_Pos)    /*!< 0x01000000 */
#define DDRPHYC_PTR1_TDINIT1_6   (0x40U << DDRPHYC_PTR1_TDINIT1_Pos)    /*!< 0x02000000 */
#define DDRPHYC_PTR1_TDINIT1_7   (0x80U << DDRPHYC_PTR1_TDINIT1_Pos)    /*!< 0x04000000 */

/*****************  Bit definition for DDRPHYC_PTR2 register  *****************/
#define DDRPHYC_PTR2_TDINIT2_Pos (0U)
#define DDRPHYC_PTR2_TDINIT2_Msk (0x1FFFFU << DDRPHYC_PTR2_TDINIT2_Pos) /*!< 0x0001FFFF */
#define DDRPHYC_PTR2_TDINIT2     DDRPHYC_PTR2_TDINIT2_Msk               /*!< tDINIT2 */
#define DDRPHYC_PTR2_TDINIT2_0   (0x1U << DDRPHYC_PTR2_TDINIT2_Pos)     /*!< 0x00000001 */
#define DDRPHYC_PTR2_TDINIT2_1   (0x2U << DDRPHYC_PTR2_TDINIT2_Pos)     /*!< 0x00000002 */
#define DDRPHYC_PTR2_TDINIT2_2   (0x4U << DDRPHYC_PTR2_TDINIT2_Pos)     /*!< 0x00000004 */
#define DDRPHYC_PTR2_TDINIT2_3   (0x8U << DDRPHYC_PTR2_TDINIT2_Pos)     /*!< 0x00000008 */
#define DDRPHYC_PTR2_TDINIT2_4   (0x10U << DDRPHYC_PTR2_TDINIT2_Pos)    /*!< 0x00000010 */
#define DDRPHYC_PTR2_TDINIT2_5   (0x20U << DDRPHYC_PTR2_TDINIT2_Pos)    /*!< 0x00000020 */
#define DDRPHYC_PTR2_TDINIT2_6   (0x40U << DDRPHYC_PTR2_TDINIT2_Pos)    /*!< 0x00000040 */
#define DDRPHYC_PTR2_TDINIT2_7   (0x80U << DDRPHYC_PTR2_TDINIT2_Pos)    /*!< 0x00000080 */
#define DDRPHYC_PTR2_TDINIT2_8   (0x100U << DDRPHYC_PTR2_TDINIT2_Pos)   /*!< 0x00000100 */
#define DDRPHYC_PTR2_TDINIT2_9   (0x200U << DDRPHYC_PTR2_TDINIT2_Pos)   /*!< 0x00000200 */
#define DDRPHYC_PTR2_TDINIT2_10  (0x400U << DDRPHYC_PTR2_TDINIT2_Pos)   /*!< 0x00000400 */
#define DDRPHYC_PTR2_TDINIT2_11  (0x800U << DDRPHYC_PTR2_TDINIT2_Pos)   /*!< 0x00000800 */
#define DDRPHYC_PTR2_TDINIT2_12  (0x1000U << DDRPHYC_PTR2_TDINIT2_Pos)  /*!< 0x00001000 */
#define DDRPHYC_PTR2_TDINIT2_13  (0x2000U << DDRPHYC_PTR2_TDINIT2_Pos)  /*!< 0x00002000 */
#define DDRPHYC_PTR2_TDINIT2_14  (0x4000U << DDRPHYC_PTR2_TDINIT2_Pos)  /*!< 0x00004000 */
#define DDRPHYC_PTR2_TDINIT2_15  (0x8000U << DDRPHYC_PTR2_TDINIT2_Pos)  /*!< 0x00008000 */
#define DDRPHYC_PTR2_TDINIT2_16  (0x10000U << DDRPHYC_PTR2_TDINIT2_Pos) /*!< 0x00010000 */
#define DDRPHYC_PTR2_TDINIT3_Pos (17U)
#define DDRPHYC_PTR2_TDINIT3_Msk (0x3FFU << DDRPHYC_PTR2_TDINIT3_Pos)   /*!< 0x07FE0000 */
#define DDRPHYC_PTR2_TDINIT3     DDRPHYC_PTR2_TDINIT3_Msk               /*!< tDINIT3 */
#define DDRPHYC_PTR2_TDINIT3_0   (0x1U << DDRPHYC_PTR2_TDINIT3_Pos)     /*!< 0x00020000 */
#define DDRPHYC_PTR2_TDINIT3_1   (0x2U << DDRPHYC_PTR2_TDINIT3_Pos)     /*!< 0x00040000 */
#define DDRPHYC_PTR2_TDINIT3_2   (0x4U << DDRPHYC_PTR2_TDINIT3_Pos)     /*!< 0x00080000 */
#define DDRPHYC_PTR2_TDINIT3_3   (0x8U << DDRPHYC_PTR2_TDINIT3_Pos)     /*!< 0x00100000 */
#define DDRPHYC_PTR2_TDINIT3_4   (0x10U << DDRPHYC_PTR2_TDINIT3_Pos)    /*!< 0x00200000 */
#define DDRPHYC_PTR2_TDINIT3_5   (0x20U << DDRPHYC_PTR2_TDINIT3_Pos)    /*!< 0x00400000 */
#define DDRPHYC_PTR2_TDINIT3_6   (0x40U << DDRPHYC_PTR2_TDINIT3_Pos)    /*!< 0x00800000 */
#define DDRPHYC_PTR2_TDINIT3_7   (0x80U << DDRPHYC_PTR2_TDINIT3_Pos)    /*!< 0x01000000 */
#define DDRPHYC_PTR2_TDINIT3_8   (0x100U << DDRPHYC_PTR2_TDINIT3_Pos)   /*!< 0x02000000 */
#define DDRPHYC_PTR2_TDINIT3_9   (0x200U << DDRPHYC_PTR2_TDINIT3_Pos)   /*!< 0x04000000 */

/****************  Bit definition for DDRPHYC_ACIOCR register  ****************/
#define DDRPHYC_ACIOCR_ACIOM_Pos   (0U)
#define DDRPHYC_ACIOCR_ACIOM_Msk   (0x1U << DDRPHYC_ACIOCR_ACIOM_Pos)   /*!< 0x00000001 */
#define DDRPHYC_ACIOCR_ACIOM       DDRPHYC_ACIOCR_ACIOM_Msk             /*!< AC pins I/O mode */
#define DDRPHYC_ACIOCR_ACOE_Pos    (1U)
#define DDRPHYC_ACIOCR_ACOE_Msk    (0x1U << DDRPHYC_ACIOCR_ACOE_Pos)    /*!< 0x00000002 */
#define DDRPHYC_ACIOCR_ACOE        DDRPHYC_ACIOCR_ACOE_Msk              /*!< AC pins output enable */
#define DDRPHYC_ACIOCR_ACODT_Pos   (2U)
#define DDRPHYC_ACIOCR_ACODT_Msk   (0x1U << DDRPHYC_ACIOCR_ACODT_Pos)   /*!< 0x00000004 */
#define DDRPHYC_ACIOCR_ACODT       DDRPHYC_ACIOCR_ACODT_Msk             /*!< AC pins ODT */
#define DDRPHYC_ACIOCR_ACPDD_Pos   (3U)
#define DDRPHYC_ACIOCR_ACPDD_Msk   (0x1U << DDRPHYC_ACIOCR_ACPDD_Pos)   /*!< 0x00000008 */
#define DDRPHYC_ACIOCR_ACPDD       DDRPHYC_ACIOCR_ACPDD_Msk             /*!< AC pins power down drivers */
#define DDRPHYC_ACIOCR_ACPDR_Pos   (4U)
#define DDRPHYC_ACIOCR_ACPDR_Msk   (0x1U << DDRPHYC_ACIOCR_ACPDR_Pos)   /*!< 0x00000010 */
#define DDRPHYC_ACIOCR_ACPDR       DDRPHYC_ACIOCR_ACPDR_Msk             /*!< AC pins power down receivers */
#define DDRPHYC_ACIOCR_CKODT_Pos   (5U)
#define DDRPHYC_ACIOCR_CKODT_Msk   (0x7U << DDRPHYC_ACIOCR_CKODT_Pos)   /*!< 0x000000E0 */
#define DDRPHYC_ACIOCR_CKODT       DDRPHYC_ACIOCR_CKODT_Msk             /*!< CK pin ODT */
#define DDRPHYC_ACIOCR_CKODT_0     (0x1U << DDRPHYC_ACIOCR_CKODT_Pos)   /*!< 0x00000020 */
#define DDRPHYC_ACIOCR_CKODT_1     (0x2U << DDRPHYC_ACIOCR_CKODT_Pos)   /*!< 0x00000040 */
#define DDRPHYC_ACIOCR_CKODT_2     (0x4U << DDRPHYC_ACIOCR_CKODT_Pos)   /*!< 0x00000080 */
#define DDRPHYC_ACIOCR_CKPDD_Pos   (8U)
#define DDRPHYC_ACIOCR_CKPDD_Msk   (0x7U << DDRPHYC_ACIOCR_CKPDD_Pos)   /*!< 0x00000700 */
#define DDRPHYC_ACIOCR_CKPDD       DDRPHYC_ACIOCR_CKPDD_Msk             /*!< CK pin power down driver */
#define DDRPHYC_ACIOCR_CKPDD_0     (0x1U << DDRPHYC_ACIOCR_CKPDD_Pos)   /*!< 0x00000100 */
#define DDRPHYC_ACIOCR_CKPDD_1     (0x2U << DDRPHYC_ACIOCR_CKPDD_Pos)   /*!< 0x00000200 */
#define DDRPHYC_ACIOCR_CKPDD_2     (0x4U << DDRPHYC_ACIOCR_CKPDD_Pos)   /*!< 0x00000400 */
#define DDRPHYC_ACIOCR_CKPDR_Pos   (11U)
#define DDRPHYC_ACIOCR_CKPDR_Msk   (0x7U << DDRPHYC_ACIOCR_CKPDR_Pos)   /*!< 0x00003800 */
#define DDRPHYC_ACIOCR_CKPDR       DDRPHYC_ACIOCR_CKPDR_Msk             /*!< CK pin power down receiver */
#define DDRPHYC_ACIOCR_CKPDR_0     (0x1U << DDRPHYC_ACIOCR_CKPDR_Pos)   /*!< 0x00000800 */
#define DDRPHYC_ACIOCR_CKPDR_1     (0x2U << DDRPHYC_ACIOCR_CKPDR_Pos)   /*!< 0x00001000 */
#define DDRPHYC_ACIOCR_CKPDR_2     (0x4U << DDRPHYC_ACIOCR_CKPDR_Pos)   /*!< 0x00002000 */
#define DDRPHYC_ACIOCR_RANKODT_Pos (14U)
#define DDRPHYC_ACIOCR_RANKODT_Msk (0x1U << DDRPHYC_ACIOCR_RANKODT_Pos) /*!< 0x00004000 */
#define DDRPHYC_ACIOCR_RANKODT     DDRPHYC_ACIOCR_RANKODT_Msk           /*!< Rank ODT */
#define DDRPHYC_ACIOCR_CSPDD_Pos   (18U)
#define DDRPHYC_ACIOCR_CSPDD_Msk   (0x1U << DDRPHYC_ACIOCR_CSPDD_Pos)   /*!< 0x00040000 */
#define DDRPHYC_ACIOCR_CSPDD       DDRPHYC_ACIOCR_CSPDD_Msk             /*!< CS power down driver */
#define DDRPHYC_ACIOCR_RANKPDR_Pos (22U)
#define DDRPHYC_ACIOCR_RANKPDR_Msk (0x1U << DDRPHYC_ACIOCR_RANKPDR_Pos) /*!< 0x00400000 */
#define DDRPHYC_ACIOCR_RANKPDR     DDRPHYC_ACIOCR_RANKPDR_Msk           /*!< Rank power down receiver */
#define DDRPHYC_ACIOCR_RSTODT_Pos  (26U)
#define DDRPHYC_ACIOCR_RSTODT_Msk  (0x1U << DDRPHYC_ACIOCR_RSTODT_Pos)  /*!< 0x04000000 */
#define DDRPHYC_ACIOCR_RSTODT      DDRPHYC_ACIOCR_RSTODT_Msk            /*!< RST pin ODT */
#define DDRPHYC_ACIOCR_RSTPDD_Pos  (27U)
#define DDRPHYC_ACIOCR_RSTPDD_Msk  (0x1U << DDRPHYC_ACIOCR_RSTPDD_Pos)  /*!< 0x08000000 */
#define DDRPHYC_ACIOCR_RSTPDD      DDRPHYC_ACIOCR_RSTPDD_Msk            /*!< RST pin power down driver */
#define DDRPHYC_ACIOCR_RSTPDR_Pos  (28U)
#define DDRPHYC_ACIOCR_RSTPDR_Msk  (0x1U << DDRPHYC_ACIOCR_RSTPDR_Pos)  /*!< 0x10000000 */
#define DDRPHYC_ACIOCR_RSTPDR      DDRPHYC_ACIOCR_RSTPDR_Msk            /*!< RST pin power down receiver */
#define DDRPHYC_ACIOCR_RSTIOM_Pos  (29U)
#define DDRPHYC_ACIOCR_RSTIOM_Msk  (0x1U << DDRPHYC_ACIOCR_RSTIOM_Pos)  /*!< 0x20000000 */
#define DDRPHYC_ACIOCR_RSTIOM      DDRPHYC_ACIOCR_RSTIOM_Msk            /*!< Reset I/O mode */
#define DDRPHYC_ACIOCR_ACSR_Pos    (30U)
#define DDRPHYC_ACIOCR_ACSR_Msk    (0x3U << DDRPHYC_ACIOCR_ACSR_Pos)    /*!< 0xC0000000 */
#define DDRPHYC_ACIOCR_ACSR        DDRPHYC_ACIOCR_ACSR_Msk              /*!< AC slew rate */
#define DDRPHYC_ACIOCR_ACSR_0      (0x1U << DDRPHYC_ACIOCR_ACSR_Pos)    /*!< 0x40000000 */
#define DDRPHYC_ACIOCR_ACSR_1      (0x2U << DDRPHYC_ACIOCR_ACSR_Pos)    /*!< 0x80000000 */

