ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157fxx_ca7.h
/****************  Bit definition for DDRPHYC_DX0GCR register  ****************/
#define DDRPHYC_DX0GCR_DXEN_Pos   (0U)
#define DDRPHYC_DX0GCR_DXEN_Msk   (0x1U << DDRPHYC_DX0GCR_DXEN_Pos)   /*!< 0x00000001 */
#define DDRPHYC_DX0GCR_DXEN       DDRPHYC_DX0GCR_DXEN_Msk             /*!< DATA byte enable */
#define DDRPHYC_DX0GCR_DQSODT_Pos (1U)
#define DDRPHYC_DX0GCR_DQSODT_Msk (0x1U << DDRPHYC_DX0GCR_DQSODT_Pos) /*!< 0x00000002 */
#define DDRPHYC_DX0GCR_DQSODT     DDRPHYC_DX0GCR_DQSODT_Msk           /*!< DQS ODT enable */
#define DDRPHYC_DX0GCR_DQODT_Pos  (2U)
#define DDRPHYC_DX0GCR_DQODT_Msk  (0x1U << DDRPHYC_DX0GCR_DQODT_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DX0GCR_DQODT      DDRPHYC_DX0GCR_DQODT_Msk            /*!< DQ ODT enable */
#define DDRPHYC_DX0GCR_DXIOM_Pos  (3U)
#define DDRPHYC_DX0GCR_DXIOM_Msk  (0x1U << DDRPHYC_DX0GCR_DXIOM_Pos)  /*!< 0x00000008 */
#define DDRPHYC_DX0GCR_DXIOM      DDRPHYC_DX0GCR_DXIOM_Msk            /*!< Data I/O mode */
#define DDRPHYC_DX0GCR_DXPDD_Pos  (4U)
#define DDRPHYC_DX0GCR_DXPDD_Msk  (0x1U << DDRPHYC_DX0GCR_DXPDD_Pos)  /*!< 0x00000010 */
#define DDRPHYC_DX0GCR_DXPDD      DDRPHYC_DX0GCR_DXPDD_Msk            /*!< Data power-down driver */
#define DDRPHYC_DX0GCR_DXPDR_Pos  (5U)
#define DDRPHYC_DX0GCR_DXPDR_Msk  (0x1U << DDRPHYC_DX0GCR_DXPDR_Pos)  /*!< 0x00000020 */
#define DDRPHYC_DX0GCR_DXPDR      DDRPHYC_DX0GCR_DXPDR_Msk            /*!< Data power-down receiver */
#define DDRPHYC_DX0GCR_DQSRPD_Pos (6U)
#define DDRPHYC_DX0GCR_DQSRPD_Msk (0x1U << DDRPHYC_DX0GCR_DQSRPD_Pos) /*!< 0x00000040 */
#define DDRPHYC_DX0GCR_DQSRPD     DDRPHYC_DX0GCR_DQSRPD_Msk           /*!< DQSR power-down */
#define DDRPHYC_DX0GCR_DSEN_Pos   (7U)
#define DDRPHYC_DX0GCR_DSEN_Msk   (0x3U << DDRPHYC_DX0GCR_DSEN_Pos)   /*!< 0x00000180 */
#define DDRPHYC_DX0GCR_DSEN       DDRPHYC_DX0GCR_DSEN_Msk             /*!< Write DQS enable */
#define DDRPHYC_DX0GCR_DSEN_0     (0x1U << DDRPHYC_DX0GCR_DSEN_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DX0GCR_DSEN_1     (0x2U << DDRPHYC_DX0GCR_DSEN_Pos)   /*!< 0x00000100 */
#define DDRPHYC_DX0GCR_DQSRTT_Pos (9U)
#define DDRPHYC_DX0GCR_DQSRTT_Msk (0x1U << DDRPHYC_DX0GCR_DQSRTT_Pos) /*!< 0x00000200 */
#define DDRPHYC_DX0GCR_DQSRTT     DDRPHYC_DX0GCR_DQSRTT_Msk           /*!< DQS dynamic RTT control */
#define DDRPHYC_DX0GCR_DQRTT_Pos  (10U)
#define DDRPHYC_DX0GCR_DQRTT_Msk  (0x1U << DDRPHYC_DX0GCR_DQRTT_Pos)  /*!< 0x00000400 */
#define DDRPHYC_DX0GCR_DQRTT      DDRPHYC_DX0GCR_DQRTT_Msk            /*!< DQ dynamic RTT control */
#define DDRPHYC_DX0GCR_RTTOH_Pos  (11U)
#define DDRPHYC_DX0GCR_RTTOH_Msk  (0x3U << DDRPHYC_DX0GCR_RTTOH_Pos)  /*!< 0x00001800 */
#define DDRPHYC_DX0GCR_RTTOH      DDRPHYC_DX0GCR_RTTOH_Msk            /*!< RTT output hold */
#define DDRPHYC_DX0GCR_RTTOH_0    (0x1U << DDRPHYC_DX0GCR_RTTOH_Pos)  /*!< 0x00000800 */
#define DDRPHYC_DX0GCR_RTTOH_1    (0x2U << DDRPHYC_DX0GCR_RTTOH_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DX0GCR_RTTOAL_Pos (13U)
#define DDRPHYC_DX0GCR_RTTOAL_Msk (0x1U << DDRPHYC_DX0GCR_RTTOAL_Pos) /*!< 0x00002000 */
#define DDRPHYC_DX0GCR_RTTOAL     DDRPHYC_DX0GCR_RTTOAL_Msk           /*!< RTT ON additive latency */
#define DDRPHYC_DX0GCR_R0RVSL_Pos (14U)
#define DDRPHYC_DX0GCR_R0RVSL_Msk (0x7U << DDRPHYC_DX0GCR_R0RVSL_Pos) /*!< 0x0001C000 */
#define DDRPHYC_DX0GCR_R0RVSL     DDRPHYC_DX0GCR_R0RVSL_Msk           /*!< Read valid system latency in steps */
#define DDRPHYC_DX0GCR_R0RVSL_0   (0x1U << DDRPHYC_DX0GCR_R0RVSL_Pos) /*!< 0x00004000 */
#define DDRPHYC_DX0GCR_R0RVSL_1   (0x2U << DDRPHYC_DX0GCR_R0RVSL_Pos) /*!< 0x00008000 */
#define DDRPHYC_DX0GCR_R0RVSL_2   (0x4U << DDRPHYC_DX0GCR_R0RVSL_Pos) /*!< 0x00010000 */

/***************  Bit definition for DDRPHYC_DX0GSR0 register  ****************/
#define DDRPHYC_DX0GSR0_DTDONE_Pos (0U)
#define DDRPHYC_DX0GSR0_DTDONE_Msk (0x1U << DDRPHYC_DX0GSR0_DTDONE_Pos) /*!< 0x00000001 */
#define DDRPHYC_DX0GSR0_DTDONE     DDRPHYC_DX0GSR0_DTDONE_Msk           /*!< Data training done */
#define DDRPHYC_DX0GSR0_DTERR_Pos  (4U)
#define DDRPHYC_DX0GSR0_DTERR_Msk  (0x1U << DDRPHYC_DX0GSR0_DTERR_Pos)  /*!< 0x00000010 */
#define DDRPHYC_DX0GSR0_DTERR      DDRPHYC_DX0GSR0_DTERR_Msk            /*!< DQS gate training error */
#define DDRPHYC_DX0GSR0_DTIERR_Pos (8U)
#define DDRPHYC_DX0GSR0_DTIERR_Msk (0x1U << DDRPHYC_DX0GSR0_DTIERR_Pos) /*!< 0x00000100 */
#define DDRPHYC_DX0GSR0_DTIERR     DDRPHYC_DX0GSR0_DTIERR_Msk           /*!< DQS gate training intermittent error */
#define DDRPHYC_DX0GSR0_DTPASS_Pos (13U)
#define DDRPHYC_DX0GSR0_DTPASS_Msk (0x7U << DDRPHYC_DX0GSR0_DTPASS_Pos) /*!< 0x0000E000 */
#define DDRPHYC_DX0GSR0_DTPASS     DDRPHYC_DX0GSR0_DTPASS_Msk           /*!< DQS training pass count */
#define DDRPHYC_DX0GSR0_DTPASS_0   (0x1U << DDRPHYC_DX0GSR0_DTPASS_Pos) /*!< 0x00002000 */
#define DDRPHYC_DX0GSR0_DTPASS_1   (0x2U << DDRPHYC_DX0GSR0_DTPASS_Pos) /*!< 0x00004000 */
#define DDRPHYC_DX0GSR0_DTPASS_2   (0x4U << DDRPHYC_DX0GSR0_DTPASS_Pos) /*!< 0x00008000 */

/***************  Bit definition for DDRPHYC_DX0GSR1 register  ****************/
#define DDRPHYC_DX0GSR1_DFTERR_Pos (0U)
#define DDRPHYC_DX0GSR1_DFTERR_Msk (0x1U << DDRPHYC_DX0GSR1_DFTERR_Pos) /*!< 0x00000001 */
#define DDRPHYC_DX0GSR1_DFTERR     DDRPHYC_DX0GSR1_DFTERR_Msk           /*!< DQS drift error */
#define DDRPHYC_DX0GSR1_DQSDFT_Pos (4U)
#define DDRPHYC_DX0GSR1_DQSDFT_Msk (0x3U << DDRPHYC_DX0GSR1_DQSDFT_Pos) /*!< 0x00000030 */
#define DDRPHYC_DX0GSR1_DQSDFT     DDRPHYC_DX0GSR1_DQSDFT_Msk           /*!< DQS drift value */
#define DDRPHYC_DX0GSR1_DQSDFT_0   (0x1U << DDRPHYC_DX0GSR1_DQSDFT_Pos) /*!< 0x00000010 */
#define DDRPHYC_DX0GSR1_DQSDFT_1   (0x2U << DDRPHYC_DX0GSR1_DQSDFT_Pos) /*!< 0x00000020 */
#define DDRPHYC_DX0GSR1_RVERR_Pos  (12U)
#define DDRPHYC_DX0GSR1_RVERR_Msk  (0x1U << DDRPHYC_DX0GSR1_RVERR_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DX0GSR1_RVERR      DDRPHYC_DX0GSR1_RVERR_Msk            /*!< RV training error */
#define DDRPHYC_DX0GSR1_RVIERR_Pos (16U)
#define DDRPHYC_DX0GSR1_RVIERR_Msk (0x1U << DDRPHYC_DX0GSR1_RVIERR_Pos) /*!< 0x00010000 */
#define DDRPHYC_DX0GSR1_RVIERR     DDRPHYC_DX0GSR1_RVIERR_Msk           /*!< RV intermittent error for rank */
#define DDRPHYC_DX0GSR1_RVPASS_Pos (20U)
#define DDRPHYC_DX0GSR1_RVPASS_Msk (0x7U << DDRPHYC_DX0GSR1_RVPASS_Pos) /*!< 0x00700000 */
#define DDRPHYC_DX0GSR1_RVPASS     DDRPHYC_DX0GSR1_RVPASS_Msk           /*!< Read valid training pass count */
#define DDRPHYC_DX0GSR1_RVPASS_0   (0x1U << DDRPHYC_DX0GSR1_RVPASS_Pos) /*!< 0x00100000 */
#define DDRPHYC_DX0GSR1_RVPASS_1   (0x2U << DDRPHYC_DX0GSR1_RVPASS_Pos) /*!< 0x00200000 */
#define DDRPHYC_DX0GSR1_RVPASS_2   (0x4U << DDRPHYC_DX0GSR1_RVPASS_Pos) /*!< 0x00400000 */

/***************  Bit definition for DDRPHYC_DX0DLLCR register  ***************/
#define DDRPHYC_DX0DLLCR_SFBDLY_Pos   (0U)
#define DDRPHYC_DX0DLLCR_SFBDLY_Msk   (0x7U << DDRPHYC_DX0DLLCR_SFBDLY_Pos)   /*!< 0x00000007 */
#define DDRPHYC_DX0DLLCR_SFBDLY       DDRPHYC_DX0DLLCR_SFBDLY_Msk             /*!< Slave DLL feed-back trim */
#define DDRPHYC_DX0DLLCR_SFBDLY_0     (0x1U << DDRPHYC_DX0DLLCR_SFBDLY_Pos)   /*!< 0x00000001 */
#define DDRPHYC_DX0DLLCR_SFBDLY_1     (0x2U << DDRPHYC_DX0DLLCR_SFBDLY_Pos)   /*!< 0x00000002 */
#define DDRPHYC_DX0DLLCR_SFBDLY_2     (0x4U << DDRPHYC_DX0DLLCR_SFBDLY_Pos)   /*!< 0x00000004 */
#define DDRPHYC_DX0DLLCR_SFWDLY_Pos   (3U)
#define DDRPHYC_DX0DLLCR_SFWDLY_Msk   (0x7U << DDRPHYC_DX0DLLCR_SFWDLY_Pos)   /*!< 0x00000038 */
#define DDRPHYC_DX0DLLCR_SFWDLY       DDRPHYC_DX0DLLCR_SFWDLY_Msk             /*!< Slave DLL feed-forward trim */
#define DDRPHYC_DX0DLLCR_SFWDLY_0     (0x1U << DDRPHYC_DX0DLLCR_SFWDLY_Pos)   /*!< 0x00000008 */
#define DDRPHYC_DX0DLLCR_SFWDLY_1     (0x2U << DDRPHYC_DX0DLLCR_SFWDLY_Pos)   /*!< 0x00000010 */
#define DDRPHYC_DX0DLLCR_SFWDLY_2     (0x4U << DDRPHYC_DX0DLLCR_SFWDLY_Pos)   /*!< 0x00000020 */
#define DDRPHYC_DX0DLLCR_MFBDLY_Pos   (6U)
#define DDRPHYC_DX0DLLCR_MFBDLY_Msk   (0x7U << DDRPHYC_DX0DLLCR_MFBDLY_Pos)   /*!< 0x000001C0 */
#define DDRPHYC_DX0DLLCR_MFBDLY       DDRPHYC_DX0DLLCR_MFBDLY_Msk             /*!< Master DLL feed-back trim */
#define DDRPHYC_DX0DLLCR_MFBDLY_0     (0x1U << DDRPHYC_DX0DLLCR_MFBDLY_Pos)   /*!< 0x00000040 */
#define DDRPHYC_DX0DLLCR_MFBDLY_1     (0x2U << DDRPHYC_DX0DLLCR_MFBDLY_Pos)   /*!< 0x00000080 */
#define DDRPHYC_DX0DLLCR_MFBDLY_2     (0x4U << DDRPHYC_DX0DLLCR_MFBDLY_Pos)   /*!< 0x00000100 */
#define DDRPHYC_DX0DLLCR_MFWDLY_Pos   (9U)
#define DDRPHYC_DX0DLLCR_MFWDLY_Msk   (0x7U << DDRPHYC_DX0DLLCR_MFWDLY_Pos)   /*!< 0x00000E00 */
#define DDRPHYC_DX0DLLCR_MFWDLY       DDRPHYC_DX0DLLCR_MFWDLY_Msk             /*!< Master DLL feed-forward trim */
#define DDRPHYC_DX0DLLCR_MFWDLY_0     (0x1U << DDRPHYC_DX0DLLCR_MFWDLY_Pos)   /*!< 0x00000200 */
#define DDRPHYC_DX0DLLCR_MFWDLY_1     (0x2U << DDRPHYC_DX0DLLCR_MFWDLY_Pos)   /*!< 0x00000400 */
#define DDRPHYC_DX0DLLCR_MFWDLY_2     (0x4U << DDRPHYC_DX0DLLCR_MFWDLY_Pos)   /*!< 0x00000800 */
#define DDRPHYC_DX0DLLCR_SSTART_Pos   (12U)
#define DDRPHYC_DX0DLLCR_SSTART_Msk   (0x3U << DDRPHYC_DX0DLLCR_SSTART_Pos)   /*!< 0x00003000 */
#define DDRPHYC_DX0DLLCR_SSTART       DDRPHYC_DX0DLLCR_SSTART_Msk             /*!< Slave DLL autostart */
#define DDRPHYC_DX0DLLCR_SSTART_0     (0x1U << DDRPHYC_DX0DLLCR_SSTART_Pos)   /*!< 0x00001000 */
#define DDRPHYC_DX0DLLCR_SSTART_1     (0x2U << DDRPHYC_DX0DLLCR_SSTART_Pos)   /*!< 0x00002000 */
#define DDRPHYC_DX0DLLCR_SDPHASE_Pos  (14U)
#define DDRPHYC_DX0DLLCR_SDPHASE_Msk  (0xFU << DDRPHYC_DX0DLLCR_SDPHASE_Pos)  /*!< 0x0003C000 */
#define DDRPHYC_DX0DLLCR_SDPHASE      DDRPHYC_DX0DLLCR_SDPHASE_Msk            /*!< Slave DLL phase */
#define DDRPHYC_DX0DLLCR_SDPHASE_0    (0x1U << DDRPHYC_DX0DLLCR_SDPHASE_Pos)  /*!< 0x00004000 */
#define DDRPHYC_DX0DLLCR_SDPHASE_1    (0x2U << DDRPHYC_DX0DLLCR_SDPHASE_Pos)  /*!< 0x00008000 */
#define DDRPHYC_DX0DLLCR_SDPHASE_2    (0x4U << DDRPHYC_DX0DLLCR_SDPHASE_Pos)  /*!< 0x00010000 */
#define DDRPHYC_DX0DLLCR_SDPHASE_3    (0x8U << DDRPHYC_DX0DLLCR_SDPHASE_Pos)  /*!< 0x00020000 */
#define DDRPHYC_DX0DLLCR_ATESTEN_Pos  (18U)
#define DDRPHYC_DX0DLLCR_ATESTEN_Msk  (0x1U << DDRPHYC_DX0DLLCR_ATESTEN_Pos)  /*!< 0x00040000 */
#define DDRPHYC_DX0DLLCR_ATESTEN      DDRPHYC_DX0DLLCR_ATESTEN_Msk            /*!< Enable path to pin 'ATO' */
#define DDRPHYC_DX0DLLCR_SDLBMODE_Pos (19U)
#define DDRPHYC_DX0DLLCR_SDLBMODE_Msk (0x1U << DDRPHYC_DX0DLLCR_SDLBMODE_Pos) /*!< 0x00080000 */
#define DDRPHYC_DX0DLLCR_SDLBMODE     DDRPHYC_DX0DLLCR_SDLBMODE_Msk           /*!< Bypass slave DLL during loopback */
#define DDRPHYC_DX0DLLCR_DLLSRST_Pos  (30U)
#define DDRPHYC_DX0DLLCR_DLLSRST_Msk  (0x1U << DDRPHYC_DX0DLLCR_DLLSRST_Pos)  /*!< 0x40000000 */
#define DDRPHYC_DX0DLLCR_DLLSRST      DDRPHYC_DX0DLLCR_DLLSRST_Msk            /*!< DLL reset */
#define DDRPHYC_DX0DLLCR_DLLDIS_Pos   (31U)
#define DDRPHYC_DX0DLLCR_DLLDIS_Msk   (0x1U << DDRPHYC_DX0DLLCR_DLLDIS_Pos)   /*!< 0x80000000 */
#define DDRPHYC_DX0DLLCR_DLLDIS       DDRPHYC_DX0DLLCR_DLLDIS_Msk             /*!< DLL bypass */

