ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157fxx_ca7.h
/****************  Bit definition for RCC_RCK12SELR register  *****************/
#define RCC_RCK12SELR_PLL12SRC_Pos                (0U)
#define RCC_RCK12SELR_PLL12SRC_Msk                (0x3U << RCC_RCK12SELR_PLL12SRC_Pos)               /*!< 0x00000003 */
#define RCC_RCK12SELR_PLL12SRC                    RCC_RCK12SELR_PLL12SRC_Msk                         /*!< Reference clock selection for PLL1 and PLL2 */
#define RCC_RCK12SELR_PLL12SRC_0                  (0x1U << RCC_RCK12SELR_PLL12SRC_Pos)               /*!< 0x00000001 */
#define RCC_RCK12SELR_PLL12SRC_1                  (0x2U << RCC_RCK12SELR_PLL12SRC_Pos)               /*!< 0x00000002 */
#define RCC_RCK12SELR_PLL12SRCRDY_Pos             (31U)
#define RCC_RCK12SELR_PLL12SRCRDY_Msk             (0x1U << RCC_RCK12SELR_PLL12SRCRDY_Pos)            /*!< 0x80000000 */
#define RCC_RCK12SELR_PLL12SRCRDY                 RCC_RCK12SELR_PLL12SRCRDY_Msk                      /*!< PLL12 reference clock switch status */

/*****************  Bit definition for RCC_MPCKDIVR register  *****************/
#define RCC_MPCKDIVR_MPUDIV_Pos                   (0U)
#define RCC_MPCKDIVR_MPUDIV_Msk                   (0x7U << RCC_MPCKDIVR_MPUDIV_Pos)                  /*!< 0x00000007 */
#define RCC_MPCKDIVR_MPUDIV                       RCC_MPCKDIVR_MPUDIV_Msk                            /*!< MPU Core clock divider */
#define RCC_MPCKDIVR_MPUDIV_0                     (0x1U << RCC_MPCKDIVR_MPUDIV_Pos)                  /*!< 0x00000001 */
#define RCC_MPCKDIVR_MPUDIV_1                     (0x2U << RCC_MPCKDIVR_MPUDIV_Pos)                  /*!< 0x00000002 */
#define RCC_MPCKDIVR_MPUDIV_2                     (0x4U << RCC_MPCKDIVR_MPUDIV_Pos)                  /*!< 0x00000004 */
#define RCC_MPCKDIVR_MPUDIVRDY_Pos                (31U)
#define RCC_MPCKDIVR_MPUDIVRDY_Msk                (0x1U << RCC_MPCKDIVR_MPUDIVRDY_Pos)               /*!< 0x80000000 */
#define RCC_MPCKDIVR_MPUDIVRDY                    RCC_MPCKDIVR_MPUDIVRDY_Msk                         /*!< MPU sub-system clock divider status */

/*****************  Bit definition for RCC_AXIDIVR register  ******************/
#define RCC_AXIDIVR_AXIDIV_Pos                    (0U)
#define RCC_AXIDIVR_AXIDIV_Msk                    (0x7U << RCC_AXIDIVR_AXIDIV_Pos)                   /*!< 0x00000007 */
#define RCC_AXIDIVR_AXIDIV                        RCC_AXIDIVR_AXIDIV_Msk                             /*!< AXI, AHB5 and AHB6 clock divider */
#define RCC_AXIDIVR_AXIDIV_0                      (0x1U << RCC_AXIDIVR_AXIDIV_Pos)                   /*!< 0x00000001 */
#define RCC_AXIDIVR_AXIDIV_1                      (0x2U << RCC_AXIDIVR_AXIDIV_Pos)                   /*!< 0x00000002 */
#define RCC_AXIDIVR_AXIDIV_2                      (0x4U << RCC_AXIDIVR_AXIDIV_Pos)                   /*!< 0x00000004 */
#define RCC_AXIDIVR_AXIDIVRDY_Pos                 (31U)
#define RCC_AXIDIVR_AXIDIVRDY_Msk                 (0x1U << RCC_AXIDIVR_AXIDIVRDY_Pos)                /*!< 0x80000000 */
#define RCC_AXIDIVR_AXIDIVRDY                     RCC_AXIDIVR_AXIDIVRDY_Msk                          /*!< AXI sub-system clock divider status */

/*****************  Bit definition for RCC_APB4DIVR register  *****************/
#define RCC_APB4DIVR_APB4DIV_Pos                  (0U)
#define RCC_APB4DIVR_APB4DIV_Msk                  (0x7U << RCC_APB4DIVR_APB4DIV_Pos)                 /*!< 0x00000007 */
#define RCC_APB4DIVR_APB4DIV                      RCC_APB4DIVR_APB4DIV_Msk                           /*!< APB4 clock divider */
#define RCC_APB4DIVR_APB4DIV_0                    (0x1U << RCC_APB4DIVR_APB4DIV_Pos)                 /*!< 0x00000001 */
#define RCC_APB4DIVR_APB4DIV_1                    (0x2U << RCC_APB4DIVR_APB4DIV_Pos)                 /*!< 0x00000002 */
#define RCC_APB4DIVR_APB4DIV_2                    (0x4U << RCC_APB4DIVR_APB4DIV_Pos)                 /*!< 0x00000004 */
#define RCC_APB4DIVR_APB4DIVRDY_Pos               (31U)
#define RCC_APB4DIVR_APB4DIVRDY_Msk               (0x1U << RCC_APB4DIVR_APB4DIVRDY_Pos)              /*!< 0x80000000 */
#define RCC_APB4DIVR_APB4DIVRDY                   RCC_APB4DIVR_APB4DIVRDY_Msk                        /*!< APB4 clock divider status */

/*****************  Bit definition for RCC_APB5DIVR register  *****************/
#define RCC_APB5DIVR_APB5DIV_Pos                  (0U)
#define RCC_APB5DIVR_APB5DIV_Msk                  (0x7U << RCC_APB5DIVR_APB5DIV_Pos)                 /*!< 0x00000007 */
#define RCC_APB5DIVR_APB5DIV                      RCC_APB5DIVR_APB5DIV_Msk                           /*!< APB5 clock divider */
#define RCC_APB5DIVR_APB5DIV_0                    (0x1U << RCC_APB5DIVR_APB5DIV_Pos)                 /*!< 0x00000001 */
#define RCC_APB5DIVR_APB5DIV_1                    (0x2U << RCC_APB5DIVR_APB5DIV_Pos)                 /*!< 0x00000002 */
#define RCC_APB5DIVR_APB5DIV_2                    (0x4U << RCC_APB5DIVR_APB5DIV_Pos)                 /*!< 0x00000004 */
#define RCC_APB5DIVR_APB5DIVRDY_Pos               (31U)
#define RCC_APB5DIVR_APB5DIVRDY_Msk               (0x1U << RCC_APB5DIVR_APB5DIVRDY_Pos)              /*!< 0x80000000 */
#define RCC_APB5DIVR_APB5DIVRDY                   RCC_APB5DIVR_APB5DIVRDY_Msk                        /*!< APB5 clock divider status */

/*****************  Bit definition for RCC_RTCDIVR register  ******************/
#define RCC_RTCDIVR_RTCDIV_Pos                    (0U)
#define RCC_RTCDIVR_RTCDIV_Msk                    (0x3FU << RCC_RTCDIVR_RTCDIV_Pos)                  /*!< 0x0000003F */
#define RCC_RTCDIVR_RTCDIV                        RCC_RTCDIVR_RTCDIV_Msk                             /*!< HSE division factor for RTC clock */
#define RCC_RTCDIVR_RTCDIV_0                      (0x1U << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x00000001 */
#define RCC_RTCDIVR_RTCDIV_1                      (0x2U << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x00000002 */
#define RCC_RTCDIVR_RTCDIV_2                      (0x4U << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x00000004 */
#define RCC_RTCDIVR_RTCDIV_3                      (0x8U << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x00000008 */
#define RCC_RTCDIVR_RTCDIV_4                      (0x10U << RCC_RTCDIVR_RTCDIV_Pos)                  /*!< 0x00000010 */
#define RCC_RTCDIVR_RTCDIV_5                      (0x20U << RCC_RTCDIVR_RTCDIV_Pos)                  /*!< 0x00000020 */

/****************  Bit definition for RCC_MSSCKSELR register  *****************/
#define RCC_MSSCKSELR_MCUSSRC_Pos                 (0U)
#define RCC_MSSCKSELR_MCUSSRC_Msk                 (0x3U << RCC_MSSCKSELR_MCUSSRC_Pos)                /*!< 0x00000003 */
#define RCC_MSSCKSELR_MCUSSRC                     RCC_MSSCKSELR_MCUSSRC_Msk                          /*!< MCUSS clock switch */
#define RCC_MSSCKSELR_MCUSSRC_0                   (0x1U << RCC_MSSCKSELR_MCUSSRC_Pos)                /*!< 0x00000001 */
#define RCC_MSSCKSELR_MCUSSRC_1                   (0x2U << RCC_MSSCKSELR_MCUSSRC_Pos)                /*!< 0x00000002 */
#define RCC_MSSCKSELR_MCUSSRCRDY_Pos              (31U)
#define RCC_MSSCKSELR_MCUSSRCRDY_Msk              (0x1U << RCC_MSSCKSELR_MCUSSRCRDY_Pos)             /*!< 0x80000000 */
#define RCC_MSSCKSELR_MCUSSRCRDY                  RCC_MSSCKSELR_MCUSSRCRDY_Msk                       /*!< MCU sub-system clock switch status */

/******************  Bit definition for RCC_PLL1CR register  ******************/
#define RCC_PLL1CR_PLLON_Pos                      (0U)
#define RCC_PLL1CR_PLLON_Msk                      (0x1U << RCC_PLL1CR_PLLON_Pos)                     /*!< 0x00000001 */
#define RCC_PLL1CR_PLLON                          RCC_PLL1CR_PLLON_Msk                               /*!< PLL1 enable */
#define RCC_PLL1CR_PLL1RDY_Pos                    (1U)
#define RCC_PLL1CR_PLL1RDY_Msk                    (0x1U << RCC_PLL1CR_PLL1RDY_Pos)                   /*!< 0x00000002 */
#define RCC_PLL1CR_PLL1RDY                        RCC_PLL1CR_PLL1RDY_Msk                             /*!< PLL1 clock ready flag */
#define RCC_PLL1CR_SSCG_CTRL_Pos                  (2U)
#define RCC_PLL1CR_SSCG_CTRL_Msk                  (0x1U << RCC_PLL1CR_SSCG_CTRL_Pos)                 /*!< 0x00000004 */
#define RCC_PLL1CR_SSCG_CTRL                      RCC_PLL1CR_SSCG_CTRL_Msk                           /*!< Spread Spectrum Clock Generator of PLL1 enable */
#define RCC_PLL1CR_DIVPEN_Pos                     (4U)
#define RCC_PLL1CR_DIVPEN_Msk                     (0x1U << RCC_PLL1CR_DIVPEN_Pos)                    /*!< 0x00000010 */
#define RCC_PLL1CR_DIVPEN                         RCC_PLL1CR_DIVPEN_Msk                              /*!< PLL1 DIVP divider output enable */
#define RCC_PLL1CR_DIVQEN_Pos                     (5U)
#define RCC_PLL1CR_DIVQEN_Msk                     (0x1U << RCC_PLL1CR_DIVQEN_Pos)                    /*!< 0x00000020 */
#define RCC_PLL1CR_DIVQEN                         RCC_PLL1CR_DIVQEN_Msk                              /*!< PLL1 DIVQ divider output enable */
#define RCC_PLL1CR_DIVREN_Pos                     (6U)
#define RCC_PLL1CR_DIVREN_Msk                     (0x1U << RCC_PLL1CR_DIVREN_Pos)                    /*!< 0x00000040 */
#define RCC_PLL1CR_DIVREN                         RCC_PLL1CR_DIVREN_Msk                              /*!< PLL1 DIVR divider output enable */

/****************  Bit definition for RCC_PLL1CFGR1 register  *****************/
#define RCC_PLL1CFGR1_DIVN_Pos                    (0U)
#define RCC_PLL1CFGR1_DIVN_Msk                    (0x1FFU << RCC_PLL1CFGR1_DIVN_Pos)                 /*!< 0x000001FF */
#define RCC_PLL1CFGR1_DIVN                        RCC_PLL1CFGR1_DIVN_Msk                             /*!< Multiplication factor for PLL1 VCO */
#define RCC_PLL1CFGR1_DIVN_0                      (0x1U << RCC_PLL1CFGR1_DIVN_Pos)                   /*!< 0x00000001 */
#define RCC_PLL1CFGR1_DIVN_1                      (0x2U << RCC_PLL1CFGR1_DIVN_Pos)                   /*!< 0x00000002 */
#define RCC_PLL1CFGR1_DIVN_2                      (0x4U << RCC_PLL1CFGR1_DIVN_Pos)                   /*!< 0x00000004 */
#define RCC_PLL1CFGR1_DIVN_3                      (0x8U << RCC_PLL1CFGR1_DIVN_Pos)                   /*!< 0x00000008 */
#define RCC_PLL1CFGR1_DIVN_4                      (0x10U << RCC_PLL1CFGR1_DIVN_Pos)                  /*!< 0x00000010 */
#define RCC_PLL1CFGR1_DIVN_5                      (0x20U << RCC_PLL1CFGR1_DIVN_Pos)                  /*!< 0x00000020 */
#define RCC_PLL1CFGR1_DIVN_6                      (0x40U << RCC_PLL1CFGR1_DIVN_Pos)                  /*!< 0x00000040 */
#define RCC_PLL1CFGR1_DIVN_7                      (0x80U << RCC_PLL1CFGR1_DIVN_Pos)                  /*!< 0x00000080 */
#define RCC_PLL1CFGR1_DIVN_8                      (0x100U << RCC_PLL1CFGR1_DIVN_Pos)                 /*!< 0x00000100 */
#define RCC_PLL1CFGR1_DIVM1_Pos                   (16U)
#define RCC_PLL1CFGR1_DIVM1_Msk                   (0x3FU << RCC_PLL1CFGR1_DIVM1_Pos)                 /*!< 0x003F0000 */
#define RCC_PLL1CFGR1_DIVM1                       RCC_PLL1CFGR1_DIVM1_Msk                            /*!< Prescaler for PLL1 */
#define RCC_PLL1CFGR1_DIVM1_0                     (0x1U << RCC_PLL1CFGR1_DIVM1_Pos)              /*!< 0x00010000 */
#define RCC_PLL1CFGR1_DIVM1_1                     (0x2U << RCC_PLL1CFGR1_DIVM1_Pos)              /*!< 0x00020000 */
#define RCC_PLL1CFGR1_DIVM1_2                     (0x4U << RCC_PLL1CFGR1_DIVM1_Pos)              /*!< 0x00040000 */
#define RCC_PLL1CFGR1_DIVM1_3                     (0x8U << RCC_PLL1CFGR1_DIVM1_Pos)              /*!< 0x00080000 */
#define RCC_PLL1CFGR1_DIVM1_4                     (0x10U << RCC_PLL1CFGR1_DIVM1_Pos)             /*!< 0x00100000 */
#define RCC_PLL1CFGR1_DIVM1_5                     (0x20U << RCC_PLL1CFGR1_DIVM1_Pos)             /*!< 0x00200000 */

/****************  Bit definition for RCC_PLL1CFGR2 register  *****************/
#define RCC_PLL1CFGR2_DIVP_Pos                    (0U)
#define RCC_PLL1CFGR2_DIVP_Msk                    (0x7FU << RCC_PLL1CFGR2_DIVP_Pos)                  /*!< 0x0000007F */
#define RCC_PLL1CFGR2_DIVP                        RCC_PLL1CFGR2_DIVP_Msk                             /*!< PLL1 DIVP division factor */
#define RCC_PLL1CFGR2_DIVP_0                      (0x1U << RCC_PLL1CFGR2_DIVP_Pos)                   /*!< 0x00000001 */
#define RCC_PLL1CFGR2_DIVP_1                      (0x2U << RCC_PLL1CFGR2_DIVP_Pos)                   /*!< 0x00000002 */
#define RCC_PLL1CFGR2_DIVP_2                      (0x4U << RCC_PLL1CFGR2_DIVP_Pos)                   /*!< 0x00000004 */
#define RCC_PLL1CFGR2_DIVP_3                      (0x8U << RCC_PLL1CFGR2_DIVP_Pos)                   /*!< 0x00000008 */
#define RCC_PLL1CFGR2_DIVP_4                      (0x10U << RCC_PLL1CFGR2_DIVP_Pos)                  /*!< 0x00000010 */
#define RCC_PLL1CFGR2_DIVP_5                      (0x20U << RCC_PLL1CFGR2_DIVP_Pos)                  /*!< 0x00000020 */
#define RCC_PLL1CFGR2_DIVP_6                      (0x40U << RCC_PLL1CFGR2_DIVP_Pos)                  /*!< 0x00000040 */
#define RCC_PLL1CFGR2_DIVQ_Pos                    (8U)
#define RCC_PLL1CFGR2_DIVQ_Msk                    (0x7FU << RCC_PLL1CFGR2_DIVQ_Pos)                  /*!< 0x00007F00 */
#define RCC_PLL1CFGR2_DIVQ                        RCC_PLL1CFGR2_DIVQ_Msk                             /*!< PLL1 DIVQ division factor */
#define RCC_PLL1CFGR2_DIVQ_0                      (0x1U << RCC_PLL1CFGR2_DIVQ_Pos)                 /*!< 0x00000100 */
#define RCC_PLL1CFGR2_DIVQ_1                      (0x2U << RCC_PLL1CFGR2_DIVQ_Pos)                 /*!< 0x00000200 */
#define RCC_PLL1CFGR2_DIVQ_2                      (0x4U << RCC_PLL1CFGR2_DIVQ_Pos)                 /*!< 0x00000400 */
#define RCC_PLL1CFGR2_DIVQ_3                      (0x8U << RCC_PLL1CFGR2_DIVQ_Pos)                 /*!< 0x00000800 */
#define RCC_PLL1CFGR2_DIVQ_4                      (0x10U << RCC_PLL1CFGR2_DIVQ_Pos)                /*!< 0x00001000 */
#define RCC_PLL1CFGR2_DIVQ_5                      (0x20U << RCC_PLL1CFGR2_DIVQ_Pos)                /*!< 0x00002000 */
#define RCC_PLL1CFGR2_DIVQ_6                      (0x40U << RCC_PLL1CFGR2_DIVQ_Pos)                /*!< 0x00004000 */
#define RCC_PLL1CFGR2_DIVR_Pos                    (16U)
#define RCC_PLL1CFGR2_DIVR_Msk                    (0x7FU << RCC_PLL1CFGR2_DIVR_Pos)                  /*!< 0x007F0000 */
#define RCC_PLL1CFGR2_DIVR                        RCC_PLL1CFGR2_DIVR_Msk                             /*!< PLL1 DIVR division factor */
#define RCC_PLL1CFGR2_DIVR_0                      (0x1U << RCC_PLL1CFGR2_DIVR_Pos)               /*!< 0x00010000 */
#define RCC_PLL1CFGR2_DIVR_1                      (0x2U << RCC_PLL1CFGR2_DIVR_Pos)               /*!< 0x00020000 */
#define RCC_PLL1CFGR2_DIVR_2                      (0x4U << RCC_PLL1CFGR2_DIVR_Pos)               /*!< 0x00040000 */
#define RCC_PLL1CFGR2_DIVR_3                      (0x8U << RCC_PLL1CFGR2_DIVR_Pos)               /*!< 0x00080000 */
#define RCC_PLL1CFGR2_DIVR_4                      (0x10U << RCC_PLL1CFGR2_DIVR_Pos)              /*!< 0x00100000 */
#define RCC_PLL1CFGR2_DIVR_5                      (0x20U << RCC_PLL1CFGR2_DIVR_Pos)              /*!< 0x00200000 */
#define RCC_PLL1CFGR2_DIVR_6                      (0x40U << RCC_PLL1CFGR2_DIVR_Pos)              /*!< 0x00400000 */

/****************  Bit definition for RCC_PLL1FRACR register  *****************/
#define RCC_PLL1FRACR_FRACV_Pos                   (3U)
#define RCC_PLL1FRACR_FRACV_Msk                   (0x1FFFU << RCC_PLL1FRACR_FRACV_Pos)               /*!< 0x0000FFF8 */
#define RCC_PLL1FRACR_FRACV                       RCC_PLL1FRACR_FRACV_Msk                            /*!< Fractional part of the multiplication factor for PLL1 VCO */
#define RCC_PLL1FRACR_FRACV_0                     (0x1U << RCC_PLL1FRACR_FRACV_Pos)                  /*!< 0x00000008 */
#define RCC_PLL1FRACR_FRACV_1                     (0x2U << RCC_PLL1FRACR_FRACV_Pos)                 /*!< 0x00000010 */
#define RCC_PLL1FRACR_FRACV_2                     (0x4U << RCC_PLL1FRACR_FRACV_Pos)                 /*!< 0x00000020 */
#define RCC_PLL1FRACR_FRACV_3                     (0x8U << RCC_PLL1FRACR_FRACV_Pos)                 /*!< 0x00000040 */
#define RCC_PLL1FRACR_FRACV_4                     (0x10U << RCC_PLL1FRACR_FRACV_Pos)                 /*!< 0x00000080 */
#define RCC_PLL1FRACR_FRACV_5                     (0x20U << RCC_PLL1FRACR_FRACV_Pos)                /*!< 0x00000100 */
#define RCC_PLL1FRACR_FRACV_6                     (0x40U << RCC_PLL1FRACR_FRACV_Pos)                /*!< 0x00000200 */
#define RCC_PLL1FRACR_FRACV_7                     (0x80U << RCC_PLL1FRACR_FRACV_Pos)                /*!< 0x00000400 */
#define RCC_PLL1FRACR_FRACV_8                     (0x100U << RCC_PLL1FRACR_FRACV_Pos)                /*!< 0x00000800 */
#define RCC_PLL1FRACR_FRACV_9                     (0x200U << RCC_PLL1FRACR_FRACV_Pos)               /*!< 0x00001000 */
#define RCC_PLL1FRACR_FRACV_10                    (0x400U << RCC_PLL1FRACR_FRACV_Pos)               /*!< 0x00002000 */
#define RCC_PLL1FRACR_FRACV_11                    (0x800U << RCC_PLL1FRACR_FRACV_Pos)               /*!< 0x00004000 */
#define RCC_PLL1FRACR_FRACV_12                    (0x1000U << RCC_PLL1FRACR_FRACV_Pos)               /*!< 0x00008000 */
#define RCC_PLL1FRACR_FRACLE_Pos                  (16U)
#define RCC_PLL1FRACR_FRACLE_Msk                  (0x1U << RCC_PLL1FRACR_FRACLE_Pos)                 /*!< 0x00010000 */
#define RCC_PLL1FRACR_FRACLE                      RCC_PLL1FRACR_FRACLE_Msk                           /*!< PLL1 fractional latch enable */

/*****************  Bit definition for RCC_PLL1CSGR register  *****************/
#define RCC_PLL1CSGR_MOD_PER_Pos                  (0U)
#define RCC_PLL1CSGR_MOD_PER_Msk                  (0x1FFFU << RCC_PLL1CSGR_MOD_PER_Pos)              /*!< 0x00001FFF */
#define RCC_PLL1CSGR_MOD_PER                      RCC_PLL1CSGR_MOD_PER_Msk                           /*!< Modulation Period Adjustment for PLL1 */
#define RCC_PLL1CSGR_MOD_PER_0                    (0x1U << RCC_PLL1CSGR_MOD_PER_Pos)                 /*!< 0x00000001 */
#define RCC_PLL1CSGR_MOD_PER_1                    (0x2U << RCC_PLL1CSGR_MOD_PER_Pos)                 /*!< 0x00000002 */
#define RCC_PLL1CSGR_MOD_PER_2                    (0x4U << RCC_PLL1CSGR_MOD_PER_Pos)                 /*!< 0x00000004 */
#define RCC_PLL1CSGR_MOD_PER_3                    (0x8U << RCC_PLL1CSGR_MOD_PER_Pos)                 /*!< 0x00000008 */
#define RCC_PLL1CSGR_MOD_PER_4                    (0x10U << RCC_PLL1CSGR_MOD_PER_Pos)                /*!< 0x00000010 */
#define RCC_PLL1CSGR_MOD_PER_5                    (0x20U << RCC_PLL1CSGR_MOD_PER_Pos)                /*!< 0x00000020 */
#define RCC_PLL1CSGR_MOD_PER_6                    (0x40U << RCC_PLL1CSGR_MOD_PER_Pos)                /*!< 0x00000040 */
#define RCC_PLL1CSGR_MOD_PER_7                    (0x80U << RCC_PLL1CSGR_MOD_PER_Pos)                /*!< 0x00000080 */
#define RCC_PLL1CSGR_MOD_PER_8                    (0x100U << RCC_PLL1CSGR_MOD_PER_Pos)               /*!< 0x00000100 */
#define RCC_PLL1CSGR_MOD_PER_9                    (0x200U << RCC_PLL1CSGR_MOD_PER_Pos)               /*!< 0x00000200 */
#define RCC_PLL1CSGR_MOD_PER_10                   (0x400U << RCC_PLL1CSGR_MOD_PER_Pos)               /*!< 0x00000400 */
#define RCC_PLL1CSGR_MOD_PER_11                   (0x800U << RCC_PLL1CSGR_MOD_PER_Pos)               /*!< 0x00000800 */
#define RCC_PLL1CSGR_MOD_PER_12                   (0x1000U << RCC_PLL1CSGR_MOD_PER_Pos)              /*!< 0x00001000 */
#define RCC_PLL1CSGR_TPDFN_DIS_Pos                (13U)
#define RCC_PLL1CSGR_TPDFN_DIS_Msk                (0x1U << RCC_PLL1CSGR_TPDFN_DIS_Pos)               /*!< 0x00002000 */
#define RCC_PLL1CSGR_TPDFN_DIS                    RCC_PLL1CSGR_TPDFN_DIS_Msk                         /*!< Dithering TPDF noise control */
#define RCC_PLL1CSGR_RPDFN_DIS_Pos                (14U)
#define RCC_PLL1CSGR_RPDFN_DIS_Msk                (0x1U << RCC_PLL1CSGR_RPDFN_DIS_Pos)               /*!< 0x00004000 */
#define RCC_PLL1CSGR_RPDFN_DIS                    RCC_PLL1CSGR_RPDFN_DIS_Msk                         /*!< Dithering RPDF noise control */
#define RCC_PLL1CSGR_SSCG_MODE_Pos                (15U)
#define RCC_PLL1CSGR_SSCG_MODE_Msk                (0x1U << RCC_PLL1CSGR_SSCG_MODE_Pos)               /*!< 0x00008000 */
#define RCC_PLL1CSGR_SSCG_MODE                    RCC_PLL1CSGR_SSCG_MODE_Msk                         /*!< Spread spectrum clock generator mode */
#define RCC_PLL1CSGR_INC_STEP_Pos                 (16U)
#define RCC_PLL1CSGR_INC_STEP_Msk                 (0x7FFFU << RCC_PLL1CSGR_INC_STEP_Pos)             /*!< 0x7FFF0000 */
#define RCC_PLL1CSGR_INC_STEP                     RCC_PLL1CSGR_INC_STEP_Msk                          /*!< Modulation Depth Adjustment for PLL1 */
#define RCC_PLL1CSGR_INC_STEP_0                   (0x1U << RCC_PLL1CSGR_INC_STEP_Pos)            /*!< 0x00010000 */
#define RCC_PLL1CSGR_INC_STEP_1                   (0x2U << RCC_PLL1CSGR_INC_STEP_Pos)            /*!< 0x00020000 */
#define RCC_PLL1CSGR_INC_STEP_2                   (0x4U << RCC_PLL1CSGR_INC_STEP_Pos)            /*!< 0x00040000 */
#define RCC_PLL1CSGR_INC_STEP_3                   (0x8U << RCC_PLL1CSGR_INC_STEP_Pos)            /*!< 0x00080000 */
#define RCC_PLL1CSGR_INC_STEP_4                   (0x10U << RCC_PLL1CSGR_INC_STEP_Pos)           /*!< 0x00100000 */
#define RCC_PLL1CSGR_INC_STEP_5                   (0x20U << RCC_PLL1CSGR_INC_STEP_Pos)           /*!< 0x00200000 */
#define RCC_PLL1CSGR_INC_STEP_6                   (0x40U << RCC_PLL1CSGR_INC_STEP_Pos)           /*!< 0x00400000 */
#define RCC_PLL1CSGR_INC_STEP_7                   (0x80U << RCC_PLL1CSGR_INC_STEP_Pos)           /*!< 0x00800000 */
#define RCC_PLL1CSGR_INC_STEP_8                   (0x100U << RCC_PLL1CSGR_INC_STEP_Pos)          /*!< 0x01000000 */
#define RCC_PLL1CSGR_INC_STEP_9                   (0x200U << RCC_PLL1CSGR_INC_STEP_Pos)          /*!< 0x02000000 */
#define RCC_PLL1CSGR_INC_STEP_10                  (0x400U << RCC_PLL1CSGR_INC_STEP_Pos)          /*!< 0x04000000 */
#define RCC_PLL1CSGR_INC_STEP_11                  (0x800U << RCC_PLL1CSGR_INC_STEP_Pos)          /*!< 0x08000000 */
#define RCC_PLL1CSGR_INC_STEP_12                  (0x1000U << RCC_PLL1CSGR_INC_STEP_Pos)         /*!< 0x10000000 */
#define RCC_PLL1CSGR_INC_STEP_13                  (0x2000U << RCC_PLL1CSGR_INC_STEP_Pos)         /*!< 0x20000000 */
#define RCC_PLL1CSGR_INC_STEP_14                  (0x4000U << RCC_PLL1CSGR_INC_STEP_Pos)         /*!< 0x40000000 */

