ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157fxx_ca7.h
/****************  Bit definition for RCC_TIMG2PRER register  *****************/
#define RCC_TIMG2PRER_TIMG2PRE_Pos                (0U)
#define RCC_TIMG2PRER_TIMG2PRE_Msk                (0x1U << RCC_TIMG2PRER_TIMG2PRE_Pos)               /*!< 0x00000001 */
#define RCC_TIMG2PRER_TIMG2PRE                    RCC_TIMG2PRER_TIMG2PRE_Msk                         /*!< Timers clocks prescaler selection */
#define RCC_TIMG2PRER_TIMG2PRERDY_Pos             (31U)
#define RCC_TIMG2PRER_TIMG2PRERDY_Msk             (0x1U << RCC_TIMG2PRER_TIMG2PRERDY_Pos)            /*!< 0x80000000 */
#define RCC_TIMG2PRER_TIMG2PRERDY                 RCC_TIMG2PRER_TIMG2PRERDY_Msk                      /*!< Timers clocks prescaler status */

/*****************  Bit definition for RCC_MCUDIVR register  ******************/
#define RCC_MCUDIVR_MCUDIV_Pos                    (0U)
#define RCC_MCUDIVR_MCUDIV_Msk                    (0xFU << RCC_MCUDIVR_MCUDIV_Pos)                   /*!< 0x0000000F */
#define RCC_MCUDIVR_MCUDIV                        RCC_MCUDIVR_MCUDIV_Msk                             /*!< MCU clock divider */
#define RCC_MCUDIVR_MCUDIV_0                      (0x1U << RCC_MCUDIVR_MCUDIV_Pos)                   /*!< 0x00000001 */
#define RCC_MCUDIVR_MCUDIV_1                      (0x2U << RCC_MCUDIVR_MCUDIV_Pos)                   /*!< 0x00000002 */
#define RCC_MCUDIVR_MCUDIV_2                      (0x4U << RCC_MCUDIVR_MCUDIV_Pos)                   /*!< 0x00000004 */
#define RCC_MCUDIVR_MCUDIV_3                      (0x8U << RCC_MCUDIVR_MCUDIV_Pos)                   /*!< 0x00000008 */
#define RCC_MCUDIVR_MCUDIVRDY_Pos                 (31U)
#define RCC_MCUDIVR_MCUDIVRDY_Msk                 (0x1U << RCC_MCUDIVR_MCUDIVRDY_Pos)                /*!< 0x80000000 */
#define RCC_MCUDIVR_MCUDIVRDY                     RCC_MCUDIVR_MCUDIVRDY_Msk                          /*!< MCU clock prescaler status */

/*****************  Bit definition for RCC_APB1DIVR register  *****************/
#define RCC_APB1DIVR_APB1DIV_Pos                  (0U)
#define RCC_APB1DIVR_APB1DIV_Msk                  (0x7U << RCC_APB1DIVR_APB1DIV_Pos)                 /*!< 0x00000007 */
#define RCC_APB1DIVR_APB1DIV                      RCC_APB1DIVR_APB1DIV_Msk                           /*!< APB1 clock divider */
#define RCC_APB1DIVR_APB1DIV_0                    (0x1U << RCC_APB1DIVR_APB1DIV_Pos)                 /*!< 0x00000001 */
#define RCC_APB1DIVR_APB1DIV_1                    (0x2U << RCC_APB1DIVR_APB1DIV_Pos)                 /*!< 0x00000002 */
#define RCC_APB1DIVR_APB1DIV_2                    (0x4U << RCC_APB1DIVR_APB1DIV_Pos)                 /*!< 0x00000004 */
#define RCC_APB1DIVR_APB1DIVRDY_Pos               (31U)
#define RCC_APB1DIVR_APB1DIVRDY_Msk               (0x1U << RCC_APB1DIVR_APB1DIVRDY_Pos)              /*!< 0x80000000 */
#define RCC_APB1DIVR_APB1DIVRDY                   RCC_APB1DIVR_APB1DIVRDY_Msk                        /*!< APB1 clock prescaler status */

/*****************  Bit definition for RCC_APB2DIVR register  *****************/
#define RCC_APB2DIVR_APB2DIV_Pos                  (0U)
#define RCC_APB2DIVR_APB2DIV_Msk                  (0x7U << RCC_APB2DIVR_APB2DIV_Pos)                 /*!< 0x00000007 */
#define RCC_APB2DIVR_APB2DIV                      RCC_APB2DIVR_APB2DIV_Msk                           /*!< APB2 clock divider */
#define RCC_APB2DIVR_APB2DIV_0                    (0x1U << RCC_APB2DIVR_APB2DIV_Pos)                 /*!< 0x00000001 */
#define RCC_APB2DIVR_APB2DIV_1                    (0x2U << RCC_APB2DIVR_APB2DIV_Pos)                 /*!< 0x00000002 */
#define RCC_APB2DIVR_APB2DIV_2                    (0x4U << RCC_APB2DIVR_APB2DIV_Pos)                 /*!< 0x00000004 */
#define RCC_APB2DIVR_APB2DIVRDY_Pos               (31U)
#define RCC_APB2DIVR_APB2DIVRDY_Msk               (0x1U << RCC_APB2DIVR_APB2DIVRDY_Pos)              /*!< 0x80000000 */
#define RCC_APB2DIVR_APB2DIVRDY                   RCC_APB2DIVR_APB2DIVRDY_Msk                        /*!< APB2 clock prescaler status */

/*****************  Bit definition for RCC_APB3DIVR register  *****************/
#define RCC_APB3DIVR_APB3DIV_Pos                  (0U)
#define RCC_APB3DIVR_APB3DIV_Msk                  (0x7U << RCC_APB3DIVR_APB3DIV_Pos)                 /*!< 0x00000007 */
#define RCC_APB3DIVR_APB3DIV                      RCC_APB3DIVR_APB3DIV_Msk                           /*!< APB3 clock divider */
#define RCC_APB3DIVR_APB3DIV_0                    (0x1U << RCC_APB3DIVR_APB3DIV_Pos)                 /*!< 0x00000001 */
#define RCC_APB3DIVR_APB3DIV_1                    (0x2U << RCC_APB3DIVR_APB3DIV_Pos)                 /*!< 0x00000002 */
#define RCC_APB3DIVR_APB3DIV_2                    (0x4U << RCC_APB3DIVR_APB3DIV_Pos)                 /*!< 0x00000004 */
#define RCC_APB3DIVR_APB3DIVRDY_Pos               (31U)
#define RCC_APB3DIVR_APB3DIVRDY_Msk               (0x1U << RCC_APB3DIVR_APB3DIVRDY_Pos)              /*!< 0x80000000 */
#define RCC_APB3DIVR_APB3DIVRDY                   RCC_APB3DIVR_APB3DIVRDY_Msk                        /*!< APB3 clock prescaler status */

/******************  Bit definition for RCC_PLL3CR register  ******************/
#define RCC_PLL3CR_PLLON_Pos                      (0U)
#define RCC_PLL3CR_PLLON_Msk                      (0x1U << RCC_PLL3CR_PLLON_Pos)                     /*!< 0x00000001 */
#define RCC_PLL3CR_PLLON                          RCC_PLL3CR_PLLON_Msk                               /*!< PLL3 enable */
#define RCC_PLL3CR_PLL3RDY_Pos                    (1U)
#define RCC_PLL3CR_PLL3RDY_Msk                    (0x1U << RCC_PLL3CR_PLL3RDY_Pos)                   /*!< 0x00000002 */
#define RCC_PLL3CR_PLL3RDY                        RCC_PLL3CR_PLL3RDY_Msk                             /*!< PLL3 clock ready flag */
#define RCC_PLL3CR_SSCG_CTRL_Pos                  (2U)
#define RCC_PLL3CR_SSCG_CTRL_Msk                  (0x1U << RCC_PLL3CR_SSCG_CTRL_Pos)                 /*!< 0x00000004 */
#define RCC_PLL3CR_SSCG_CTRL                      RCC_PLL3CR_SSCG_CTRL_Msk                           /*!< Clock Spreading Generator of PLL3 enable */
#define RCC_PLL3CR_DIVPEN_Pos                     (4U)
#define RCC_PLL3CR_DIVPEN_Msk                     (0x1U << RCC_PLL3CR_DIVPEN_Pos)                    /*!< 0x00000010 */
#define RCC_PLL3CR_DIVPEN                         RCC_PLL3CR_DIVPEN_Msk                              /*!< PLL3 DIVP divider output enable */
#define RCC_PLL3CR_DIVQEN_Pos                     (5U)
#define RCC_PLL3CR_DIVQEN_Msk                     (0x1U << RCC_PLL3CR_DIVQEN_Pos)                    /*!< 0x00000020 */
#define RCC_PLL3CR_DIVQEN                         RCC_PLL3CR_DIVQEN_Msk                              /*!< PLL3 DIVQ divider output enable */
#define RCC_PLL3CR_DIVREN_Pos                     (6U)
#define RCC_PLL3CR_DIVREN_Msk                     (0x1U << RCC_PLL3CR_DIVREN_Pos)                    /*!< 0x00000040 */
#define RCC_PLL3CR_DIVREN                         RCC_PLL3CR_DIVREN_Msk                              /*!< PLL3 DIVR divider output enable */

