ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157fxx_ca7.h
/**************  Bit definition for RCC_MP_AHB3ENSETR register  ***************/
#define RCC_MP_AHB3ENSETR_DCMIEN_Pos              (0U)
#define RCC_MP_AHB3ENSETR_DCMIEN_Msk              (0x1U << RCC_MP_AHB3ENSETR_DCMIEN_Pos)             /*!< 0x00000001 */
#define RCC_MP_AHB3ENSETR_DCMIEN                  RCC_MP_AHB3ENSETR_DCMIEN_Msk                       /*!< DCMI peripheral clocks enable */
#define RCC_MP_AHB3ENSETR_CRYP2EN_Pos             (4U)
#define RCC_MP_AHB3ENSETR_CRYP2EN_Msk             (0x1U << RCC_MP_AHB3ENSETR_CRYP2EN_Pos)            /*!< 0x00000010 */
#define RCC_MP_AHB3ENSETR_CRYP2EN                 RCC_MP_AHB3ENSETR_CRYP2EN_Msk                      /*!< CRYP2 (3DES/AES2) peripheral clocks enable */
#define RCC_MP_AHB3ENSETR_HASH2EN_Pos             (5U)
#define RCC_MP_AHB3ENSETR_HASH2EN_Msk             (0x1U << RCC_MP_AHB3ENSETR_HASH2EN_Pos)            /*!< 0x00000020 */
#define RCC_MP_AHB3ENSETR_HASH2EN                 RCC_MP_AHB3ENSETR_HASH2EN_Msk                      /*!< HASH2 peripheral clocks enable */
#define RCC_MP_AHB3ENSETR_RNG2EN_Pos              (6U)
#define RCC_MP_AHB3ENSETR_RNG2EN_Msk              (0x1U << RCC_MP_AHB3ENSETR_RNG2EN_Pos)             /*!< 0x00000040 */
#define RCC_MP_AHB3ENSETR_RNG2EN                  RCC_MP_AHB3ENSETR_RNG2EN_Msk                       /*!< RNG2 peripheral clocks enable */
#define RCC_MP_AHB3ENSETR_CRC2EN_Pos              (7U)
#define RCC_MP_AHB3ENSETR_CRC2EN_Msk              (0x1U << RCC_MP_AHB3ENSETR_CRC2EN_Pos)             /*!< 0x00000080 */
#define RCC_MP_AHB3ENSETR_CRC2EN                  RCC_MP_AHB3ENSETR_CRC2EN_Msk                       /*!< CRC2 peripheral clocks enable */
#define RCC_MP_AHB3ENSETR_HSEMEN_Pos              (11U)
#define RCC_MP_AHB3ENSETR_HSEMEN_Msk              (0x1U << RCC_MP_AHB3ENSETR_HSEMEN_Pos)             /*!< 0x00000800 */
#define RCC_MP_AHB3ENSETR_HSEMEN                  RCC_MP_AHB3ENSETR_HSEMEN_Msk                       /*!< HSEM peripheral clocks enable */
#define RCC_MP_AHB3ENSETR_IPCCEN_Pos              (12U)
#define RCC_MP_AHB3ENSETR_IPCCEN_Msk              (0x1U << RCC_MP_AHB3ENSETR_IPCCEN_Pos)             /*!< 0x00001000 */
#define RCC_MP_AHB3ENSETR_IPCCEN                  RCC_MP_AHB3ENSETR_IPCCEN_Msk                       /*!< IPCC peripheral clocks enable */

/**************  Bit definition for RCC_MP_AHB3ENCLRR register  ***************/
#define RCC_MP_AHB3ENCLRR_DCMIEN_Pos              (0U)
#define RCC_MP_AHB3ENCLRR_DCMIEN_Msk              (0x1U << RCC_MP_AHB3ENCLRR_DCMIEN_Pos)             /*!< 0x00000001 */
#define RCC_MP_AHB3ENCLRR_DCMIEN                  RCC_MP_AHB3ENCLRR_DCMIEN_Msk                       /*!< DCMI peripheral clocks enable */
#define RCC_MP_AHB3ENCLRR_CRYP2EN_Pos             (4U)
#define RCC_MP_AHB3ENCLRR_CRYP2EN_Msk             (0x1U << RCC_MP_AHB3ENCLRR_CRYP2EN_Pos)            /*!< 0x00000010 */
#define RCC_MP_AHB3ENCLRR_CRYP2EN                 RCC_MP_AHB3ENCLRR_CRYP2EN_Msk                      /*!< CRYP2 (3DES/AES2) peripheral clocks enable */
#define RCC_MP_AHB3ENCLRR_HASH2EN_Pos             (5U)
#define RCC_MP_AHB3ENCLRR_HASH2EN_Msk             (0x1U << RCC_MP_AHB3ENCLRR_HASH2EN_Pos)            /*!< 0x00000020 */
#define RCC_MP_AHB3ENCLRR_HASH2EN                 RCC_MP_AHB3ENCLRR_HASH2EN_Msk                      /*!< HASH2 peripheral clocks enable */
#define RCC_MP_AHB3ENCLRR_RNG2EN_Pos              (6U)
#define RCC_MP_AHB3ENCLRR_RNG2EN_Msk              (0x1U << RCC_MP_AHB3ENCLRR_RNG2EN_Pos)             /*!< 0x00000040 */
#define RCC_MP_AHB3ENCLRR_RNG2EN                  RCC_MP_AHB3ENCLRR_RNG2EN_Msk                       /*!< RNG2 peripheral clocks enable */
#define RCC_MP_AHB3ENCLRR_CRC2EN_Pos              (7U)
#define RCC_MP_AHB3ENCLRR_CRC2EN_Msk              (0x1U << RCC_MP_AHB3ENCLRR_CRC2EN_Pos)             /*!< 0x00000080 */
#define RCC_MP_AHB3ENCLRR_CRC2EN                  RCC_MP_AHB3ENCLRR_CRC2EN_Msk                       /*!< CRC2 peripheral clocks enable */
#define RCC_MP_AHB3ENCLRR_HSEMEN_Pos              (11U)
#define RCC_MP_AHB3ENCLRR_HSEMEN_Msk              (0x1U << RCC_MP_AHB3ENCLRR_HSEMEN_Pos)             /*!< 0x00000800 */
#define RCC_MP_AHB3ENCLRR_HSEMEN                  RCC_MP_AHB3ENCLRR_HSEMEN_Msk                       /*!< HSEM peripheral clocks enable */
#define RCC_MP_AHB3ENCLRR_IPCCEN_Pos              (12U)
#define RCC_MP_AHB3ENCLRR_IPCCEN_Msk              (0x1U << RCC_MP_AHB3ENCLRR_IPCCEN_Pos)             /*!< 0x00001000 */
#define RCC_MP_AHB3ENCLRR_IPCCEN                  RCC_MP_AHB3ENCLRR_IPCCEN_Msk                       /*!< IPCC peripheral clocks enable */

/**************  Bit definition for RCC_MP_AHB4ENSETR register  ***************/
#define RCC_MP_AHB4ENSETR_GPIOAEN_Pos             (0U)
#define RCC_MP_AHB4ENSETR_GPIOAEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOAEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_AHB4ENSETR_GPIOAEN                 RCC_MP_AHB4ENSETR_GPIOAEN_Msk                      /*!< GPIOA peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOBEN_Pos             (1U)
#define RCC_MP_AHB4ENSETR_GPIOBEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOBEN_Pos)            /*!< 0x00000002 */
#define RCC_MP_AHB4ENSETR_GPIOBEN                 RCC_MP_AHB4ENSETR_GPIOBEN_Msk                      /*!< GPIOB peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOCEN_Pos             (2U)
#define RCC_MP_AHB4ENSETR_GPIOCEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOCEN_Pos)            /*!< 0x00000004 */
#define RCC_MP_AHB4ENSETR_GPIOCEN                 RCC_MP_AHB4ENSETR_GPIOCEN_Msk                      /*!< GPIOC peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIODEN_Pos             (3U)
#define RCC_MP_AHB4ENSETR_GPIODEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIODEN_Pos)            /*!< 0x00000008 */
#define RCC_MP_AHB4ENSETR_GPIODEN                 RCC_MP_AHB4ENSETR_GPIODEN_Msk                      /*!< GPIOD peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOEEN_Pos             (4U)
#define RCC_MP_AHB4ENSETR_GPIOEEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOEEN_Pos)            /*!< 0x00000010 */
#define RCC_MP_AHB4ENSETR_GPIOEEN                 RCC_MP_AHB4ENSETR_GPIOEEN_Msk                      /*!< GPIOE peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOFEN_Pos             (5U)
#define RCC_MP_AHB4ENSETR_GPIOFEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOFEN_Pos)            /*!< 0x00000020 */
#define RCC_MP_AHB4ENSETR_GPIOFEN                 RCC_MP_AHB4ENSETR_GPIOFEN_Msk                      /*!< GPIOF peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOGEN_Pos             (6U)
#define RCC_MP_AHB4ENSETR_GPIOGEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOGEN_Pos)            /*!< 0x00000040 */
#define RCC_MP_AHB4ENSETR_GPIOGEN                 RCC_MP_AHB4ENSETR_GPIOGEN_Msk                      /*!< GPIOG peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOHEN_Pos             (7U)
#define RCC_MP_AHB4ENSETR_GPIOHEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOHEN_Pos)            /*!< 0x00000080 */
#define RCC_MP_AHB4ENSETR_GPIOHEN                 RCC_MP_AHB4ENSETR_GPIOHEN_Msk                      /*!< GPIOH peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOIEN_Pos             (8U)
#define RCC_MP_AHB4ENSETR_GPIOIEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOIEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_AHB4ENSETR_GPIOIEN                 RCC_MP_AHB4ENSETR_GPIOIEN_Msk                      /*!< GPIOI peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOJEN_Pos             (9U)
#define RCC_MP_AHB4ENSETR_GPIOJEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOJEN_Pos)            /*!< 0x00000200 */
#define RCC_MP_AHB4ENSETR_GPIOJEN                 RCC_MP_AHB4ENSETR_GPIOJEN_Msk                      /*!< GPIOJ peripheral clocks enable */
#define RCC_MP_AHB4ENSETR_GPIOKEN_Pos             (10U)
#define RCC_MP_AHB4ENSETR_GPIOKEN_Msk             (0x1U << RCC_MP_AHB4ENSETR_GPIOKEN_Pos)            /*!< 0x00000400 */
#define RCC_MP_AHB4ENSETR_GPIOKEN                 RCC_MP_AHB4ENSETR_GPIOKEN_Msk                      /*!< GPIOK peripheral clocks enable */

/**************  Bit definition for RCC_MP_AHB4ENCLRR register  ***************/
#define RCC_MP_AHB4ENCLRR_GPIOAEN_Pos             (0U)
#define RCC_MP_AHB4ENCLRR_GPIOAEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOAEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_AHB4ENCLRR_GPIOAEN                 RCC_MP_AHB4ENCLRR_GPIOAEN_Msk                      /*!< GPIOA peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOBEN_Pos             (1U)
#define RCC_MP_AHB4ENCLRR_GPIOBEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOBEN_Pos)            /*!< 0x00000002 */
#define RCC_MP_AHB4ENCLRR_GPIOBEN                 RCC_MP_AHB4ENCLRR_GPIOBEN_Msk                      /*!< GPIOB peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOCEN_Pos             (2U)
#define RCC_MP_AHB4ENCLRR_GPIOCEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOCEN_Pos)            /*!< 0x00000004 */
#define RCC_MP_AHB4ENCLRR_GPIOCEN                 RCC_MP_AHB4ENCLRR_GPIOCEN_Msk                      /*!< GPIOC peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIODEN_Pos             (3U)
#define RCC_MP_AHB4ENCLRR_GPIODEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIODEN_Pos)            /*!< 0x00000008 */
#define RCC_MP_AHB4ENCLRR_GPIODEN                 RCC_MP_AHB4ENCLRR_GPIODEN_Msk                      /*!< GPIOD peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOEEN_Pos             (4U)
#define RCC_MP_AHB4ENCLRR_GPIOEEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOEEN_Pos)            /*!< 0x00000010 */
#define RCC_MP_AHB4ENCLRR_GPIOEEN                 RCC_MP_AHB4ENCLRR_GPIOEEN_Msk                      /*!< GPIOE peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOFEN_Pos             (5U)
#define RCC_MP_AHB4ENCLRR_GPIOFEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOFEN_Pos)            /*!< 0x00000020 */
#define RCC_MP_AHB4ENCLRR_GPIOFEN                 RCC_MP_AHB4ENCLRR_GPIOFEN_Msk                      /*!< GPIOF peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOGEN_Pos             (6U)
#define RCC_MP_AHB4ENCLRR_GPIOGEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOGEN_Pos)            /*!< 0x00000040 */
#define RCC_MP_AHB4ENCLRR_GPIOGEN                 RCC_MP_AHB4ENCLRR_GPIOGEN_Msk                      /*!< GPIOG peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOHEN_Pos             (7U)
#define RCC_MP_AHB4ENCLRR_GPIOHEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOHEN_Pos)            /*!< 0x00000080 */
#define RCC_MP_AHB4ENCLRR_GPIOHEN                 RCC_MP_AHB4ENCLRR_GPIOHEN_Msk                      /*!< GPIOH peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOIEN_Pos             (8U)
#define RCC_MP_AHB4ENCLRR_GPIOIEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOIEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_AHB4ENCLRR_GPIOIEN                 RCC_MP_AHB4ENCLRR_GPIOIEN_Msk                      /*!< GPIOI peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOJEN_Pos             (9U)
#define RCC_MP_AHB4ENCLRR_GPIOJEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOJEN_Pos)            /*!< 0x00000200 */
#define RCC_MP_AHB4ENCLRR_GPIOJEN                 RCC_MP_AHB4ENCLRR_GPIOJEN_Msk                      /*!< GPIOJ peripheral clocks enable */
#define RCC_MP_AHB4ENCLRR_GPIOKEN_Pos             (10U)
#define RCC_MP_AHB4ENCLRR_GPIOKEN_Msk             (0x1U << RCC_MP_AHB4ENCLRR_GPIOKEN_Pos)            /*!< 0x00000400 */
#define RCC_MP_AHB4ENCLRR_GPIOKEN                 RCC_MP_AHB4ENCLRR_GPIOKEN_Msk                      /*!< GPIOK peripheral clocks enable */

/**************  Bit definition for RCC_MP_MLAHBENSETR register  **************/
#define RCC_MP_MLAHBENSETR_RETRAMEN_Pos           (4U)
#define RCC_MP_MLAHBENSETR_RETRAMEN_Msk           (0x1U << RCC_MP_MLAHBENSETR_RETRAMEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_MLAHBENSETR_RETRAMEN               RCC_MP_MLAHBENSETR_RETRAMEN_Msk                    /*!< RETRAM peripheral clocks enable */

