ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157fxx_ca7.h
/**************  Bit definition for RCC_MC_AHB4ENCLRR register  ***************/
#define RCC_MC_AHB4ENCLRR_GPIOAEN_Pos             (0U)
#define RCC_MC_AHB4ENCLRR_GPIOAEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOAEN_Pos)            /*!< 0x00000001 */
#define RCC_MC_AHB4ENCLRR_GPIOAEN                 RCC_MC_AHB4ENCLRR_GPIOAEN_Msk                      /*!< GPIOA peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOBEN_Pos             (1U)
#define RCC_MC_AHB4ENCLRR_GPIOBEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOBEN_Pos)            /*!< 0x00000002 */
#define RCC_MC_AHB4ENCLRR_GPIOBEN                 RCC_MC_AHB4ENCLRR_GPIOBEN_Msk                      /*!< GPIOB peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOCEN_Pos             (2U)
#define RCC_MC_AHB4ENCLRR_GPIOCEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOCEN_Pos)            /*!< 0x00000004 */
#define RCC_MC_AHB4ENCLRR_GPIOCEN                 RCC_MC_AHB4ENCLRR_GPIOCEN_Msk                      /*!< GPIOC peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIODEN_Pos             (3U)
#define RCC_MC_AHB4ENCLRR_GPIODEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIODEN_Pos)            /*!< 0x00000008 */
#define RCC_MC_AHB4ENCLRR_GPIODEN                 RCC_MC_AHB4ENCLRR_GPIODEN_Msk                      /*!< GPIOD peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOEEN_Pos             (4U)
#define RCC_MC_AHB4ENCLRR_GPIOEEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOEEN_Pos)            /*!< 0x00000010 */
#define RCC_MC_AHB4ENCLRR_GPIOEEN                 RCC_MC_AHB4ENCLRR_GPIOEEN_Msk                      /*!< GPIOE peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOFEN_Pos             (5U)
#define RCC_MC_AHB4ENCLRR_GPIOFEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOFEN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB4ENCLRR_GPIOFEN                 RCC_MC_AHB4ENCLRR_GPIOFEN_Msk                      /*!< GPIOF peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOGEN_Pos             (6U)
#define RCC_MC_AHB4ENCLRR_GPIOGEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOGEN_Pos)            /*!< 0x00000040 */
#define RCC_MC_AHB4ENCLRR_GPIOGEN                 RCC_MC_AHB4ENCLRR_GPIOGEN_Msk                      /*!< GPIOG peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOHEN_Pos             (7U)
#define RCC_MC_AHB4ENCLRR_GPIOHEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOHEN_Pos)            /*!< 0x00000080 */
#define RCC_MC_AHB4ENCLRR_GPIOHEN                 RCC_MC_AHB4ENCLRR_GPIOHEN_Msk                      /*!< GPIOH peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOIEN_Pos             (8U)
#define RCC_MC_AHB4ENCLRR_GPIOIEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOIEN_Pos)            /*!< 0x00000100 */
#define RCC_MC_AHB4ENCLRR_GPIOIEN                 RCC_MC_AHB4ENCLRR_GPIOIEN_Msk                      /*!< GPIOI peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOJEN_Pos             (9U)
#define RCC_MC_AHB4ENCLRR_GPIOJEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOJEN_Pos)            /*!< 0x00000200 */
#define RCC_MC_AHB4ENCLRR_GPIOJEN                 RCC_MC_AHB4ENCLRR_GPIOJEN_Msk                      /*!< GPIOJ peripheral clocks enable */
#define RCC_MC_AHB4ENCLRR_GPIOKEN_Pos             (10U)
#define RCC_MC_AHB4ENCLRR_GPIOKEN_Msk             (0x1U << RCC_MC_AHB4ENCLRR_GPIOKEN_Pos)            /*!< 0x00000400 */
#define RCC_MC_AHB4ENCLRR_GPIOKEN                 RCC_MC_AHB4ENCLRR_GPIOKEN_Msk                      /*!< GPIOK peripheral clocks enable */

/**************  Bit definition for RCC_MC_AXIMENSETR register  ***************/
#define RCC_MC_AXIMENSETR_SYSRAMEN_Pos            (0U)
#define RCC_MC_AXIMENSETR_SYSRAMEN_Msk            (0x1U << RCC_MC_AXIMENSETR_SYSRAMEN_Pos)           /*!< 0x00000001 */
#define RCC_MC_AXIMENSETR_SYSRAMEN                RCC_MC_AXIMENSETR_SYSRAMEN_Msk                     /*!< SYSRAM peripheral clocks enable */

/**************  Bit definition for RCC_MC_AXIMENCLRR register  ***************/
#define RCC_MC_AXIMENCLRR_SYSRAMEN_Pos            (0U)
#define RCC_MC_AXIMENCLRR_SYSRAMEN_Msk            (0x1U << RCC_MC_AXIMENCLRR_SYSRAMEN_Pos)           /*!< 0x00000001 */
#define RCC_MC_AXIMENCLRR_SYSRAMEN                RCC_MC_AXIMENCLRR_SYSRAMEN_Msk                     /*!< SYSRAM peripheral clocks enable */

/**************  Bit definition for RCC_MC_MLAHBENSETR register  **************/
#define RCC_MC_MLAHBENSETR_RETRAMEN_Pos           (4U)
#define RCC_MC_MLAHBENSETR_RETRAMEN_Msk           (0x1U << RCC_MC_MLAHBENSETR_RETRAMEN_Pos)          /*!< 0x00000010 */
#define RCC_MC_MLAHBENSETR_RETRAMEN               RCC_MC_MLAHBENSETR_RETRAMEN_Msk                    /*!< RETRAM peripheral clocks enable */

/**************  Bit definition for RCC_MC_MLAHBENCLRR register  **************/
#define RCC_MC_MLAHBENCLRR_RETRAMEN_Pos           (4U)
#define RCC_MC_MLAHBENCLRR_RETRAMEN_Msk           (0x1U << RCC_MC_MLAHBENCLRR_RETRAMEN_Pos)          /*!< 0x00000010 */
#define RCC_MC_MLAHBENCLRR_RETRAMEN               RCC_MC_MLAHBENCLRR_RETRAMEN_Msk                    /*!< RETRAM peripheral clocks enable */

/*************  Bit definition for RCC_MP_APB1LPENSETR register  **************/
#define RCC_MP_APB1LPENSETR_TIM2LPEN_Pos          (0U)
#define RCC_MP_APB1LPENSETR_TIM2LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_TIM2LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_APB1LPENSETR_TIM2LPEN              RCC_MP_APB1LPENSETR_TIM2LPEN_Msk                   /*!< TIM2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM3LPEN_Pos          (1U)
#define RCC_MP_APB1LPENSETR_TIM3LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_TIM3LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MP_APB1LPENSETR_TIM3LPEN              RCC_MP_APB1LPENSETR_TIM3LPEN_Msk                   /*!< TIM3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM4LPEN_Pos          (2U)
#define RCC_MP_APB1LPENSETR_TIM4LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_TIM4LPEN_Pos)         /*!< 0x00000004 */
#define RCC_MP_APB1LPENSETR_TIM4LPEN              RCC_MP_APB1LPENSETR_TIM4LPEN_Msk                   /*!< TIM4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM5LPEN_Pos          (3U)
#define RCC_MP_APB1LPENSETR_TIM5LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_TIM5LPEN_Pos)         /*!< 0x00000008 */
#define RCC_MP_APB1LPENSETR_TIM5LPEN              RCC_MP_APB1LPENSETR_TIM5LPEN_Msk                   /*!< TIM5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM6LPEN_Pos          (4U)
#define RCC_MP_APB1LPENSETR_TIM6LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_TIM6LPEN_Pos)         /*!< 0x00000010 */
#define RCC_MP_APB1LPENSETR_TIM6LPEN              RCC_MP_APB1LPENSETR_TIM6LPEN_Msk                   /*!< TIM6 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM7LPEN_Pos          (5U)
#define RCC_MP_APB1LPENSETR_TIM7LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_TIM7LPEN_Pos)         /*!< 0x00000020 */
#define RCC_MP_APB1LPENSETR_TIM7LPEN              RCC_MP_APB1LPENSETR_TIM7LPEN_Msk                   /*!< TIM7 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM12LPEN_Pos         (6U)
#define RCC_MP_APB1LPENSETR_TIM12LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_TIM12LPEN_Pos)        /*!< 0x00000040 */
#define RCC_MP_APB1LPENSETR_TIM12LPEN             RCC_MP_APB1LPENSETR_TIM12LPEN_Msk                  /*!< TIM12 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM13LPEN_Pos         (7U)
#define RCC_MP_APB1LPENSETR_TIM13LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_TIM13LPEN_Pos)        /*!< 0x00000080 */
#define RCC_MP_APB1LPENSETR_TIM13LPEN             RCC_MP_APB1LPENSETR_TIM13LPEN_Msk                  /*!< TIM13 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_TIM14LPEN_Pos         (8U)
#define RCC_MP_APB1LPENSETR_TIM14LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_TIM14LPEN_Pos)        /*!< 0x00000100 */
#define RCC_MP_APB1LPENSETR_TIM14LPEN             RCC_MP_APB1LPENSETR_TIM14LPEN_Msk                  /*!< TIM14 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN_Pos        (9U)
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN_Msk        (0x1U << RCC_MP_APB1LPENSETR_LPTIM1LPEN_Pos)       /*!< 0x00000200 */
#define RCC_MP_APB1LPENSETR_LPTIM1LPEN            RCC_MP_APB1LPENSETR_LPTIM1LPEN_Msk                 /*!< LPTIM1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_SPI2LPEN_Pos          (11U)
#define RCC_MP_APB1LPENSETR_SPI2LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_SPI2LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_APB1LPENSETR_SPI2LPEN              RCC_MP_APB1LPENSETR_SPI2LPEN_Msk                   /*!< SPI2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_SPI3LPEN_Pos          (12U)
#define RCC_MP_APB1LPENSETR_SPI3LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_SPI3LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MP_APB1LPENSETR_SPI3LPEN              RCC_MP_APB1LPENSETR_SPI3LPEN_Msk                   /*!< SPI3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_USART2LPEN_Pos        (14U)
#define RCC_MP_APB1LPENSETR_USART2LPEN_Msk        (0x1U << RCC_MP_APB1LPENSETR_USART2LPEN_Pos)       /*!< 0x00004000 */
#define RCC_MP_APB1LPENSETR_USART2LPEN            RCC_MP_APB1LPENSETR_USART2LPEN_Msk                 /*!< USART2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_USART3LPEN_Pos        (15U)
#define RCC_MP_APB1LPENSETR_USART3LPEN_Msk        (0x1U << RCC_MP_APB1LPENSETR_USART3LPEN_Pos)       /*!< 0x00008000 */
#define RCC_MP_APB1LPENSETR_USART3LPEN            RCC_MP_APB1LPENSETR_USART3LPEN_Msk                 /*!< USART3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_UART4LPEN_Pos         (16U)
#define RCC_MP_APB1LPENSETR_UART4LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_UART4LPEN_Pos)        /*!< 0x00010000 */
#define RCC_MP_APB1LPENSETR_UART4LPEN             RCC_MP_APB1LPENSETR_UART4LPEN_Msk                  /*!< UART4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_UART5LPEN_Pos         (17U)
#define RCC_MP_APB1LPENSETR_UART5LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_UART5LPEN_Pos)        /*!< 0x00020000 */
#define RCC_MP_APB1LPENSETR_UART5LPEN             RCC_MP_APB1LPENSETR_UART5LPEN_Msk                  /*!< UART5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_UART7LPEN_Pos         (18U)
#define RCC_MP_APB1LPENSETR_UART7LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_UART7LPEN_Pos)        /*!< 0x00040000 */
#define RCC_MP_APB1LPENSETR_UART7LPEN             RCC_MP_APB1LPENSETR_UART7LPEN_Msk                  /*!< UART7 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_UART8LPEN_Pos         (19U)
#define RCC_MP_APB1LPENSETR_UART8LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_UART8LPEN_Pos)        /*!< 0x00080000 */
#define RCC_MP_APB1LPENSETR_UART8LPEN             RCC_MP_APB1LPENSETR_UART8LPEN_Msk                  /*!< UART8 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_I2C1LPEN_Pos          (21U)
#define RCC_MP_APB1LPENSETR_I2C1LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_I2C1LPEN_Pos)         /*!< 0x00200000 */
#define RCC_MP_APB1LPENSETR_I2C1LPEN              RCC_MP_APB1LPENSETR_I2C1LPEN_Msk                   /*!< I2C1 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_I2C2LPEN_Pos          (22U)
#define RCC_MP_APB1LPENSETR_I2C2LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_I2C2LPEN_Pos)         /*!< 0x00400000 */
#define RCC_MP_APB1LPENSETR_I2C2LPEN              RCC_MP_APB1LPENSETR_I2C2LPEN_Msk                   /*!< I2C2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_I2C3LPEN_Pos          (23U)
#define RCC_MP_APB1LPENSETR_I2C3LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_I2C3LPEN_Pos)         /*!< 0x00800000 */
#define RCC_MP_APB1LPENSETR_I2C3LPEN              RCC_MP_APB1LPENSETR_I2C3LPEN_Msk                   /*!< I2C3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_I2C5LPEN_Pos          (24U)
#define RCC_MP_APB1LPENSETR_I2C5LPEN_Msk          (0x1U << RCC_MP_APB1LPENSETR_I2C5LPEN_Pos)         /*!< 0x01000000 */
#define RCC_MP_APB1LPENSETR_I2C5LPEN              RCC_MP_APB1LPENSETR_I2C5LPEN_Msk                   /*!< I2C5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_SPDIFLPEN_Pos         (26U)
#define RCC_MP_APB1LPENSETR_SPDIFLPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_SPDIFLPEN_Pos)        /*!< 0x04000000 */
#define RCC_MP_APB1LPENSETR_SPDIFLPEN             RCC_MP_APB1LPENSETR_SPDIFLPEN_Msk                  /*!< SPDIFRX peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_CECLPEN_Pos           (27U)
#define RCC_MP_APB1LPENSETR_CECLPEN_Msk           (0x1U << RCC_MP_APB1LPENSETR_CECLPEN_Pos)          /*!< 0x08000000 */
#define RCC_MP_APB1LPENSETR_CECLPEN               RCC_MP_APB1LPENSETR_CECLPEN_Msk                    /*!< HDMI-CEC peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_DAC12LPEN_Pos         (29U)
#define RCC_MP_APB1LPENSETR_DAC12LPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_DAC12LPEN_Pos)        /*!< 0x20000000 */
#define RCC_MP_APB1LPENSETR_DAC12LPEN             RCC_MP_APB1LPENSETR_DAC12LPEN_Msk                  /*!< DAC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB1LPENSETR_MDIOSLPEN_Pos         (31U)
#define RCC_MP_APB1LPENSETR_MDIOSLPEN_Msk         (0x1U << RCC_MP_APB1LPENSETR_MDIOSLPEN_Pos)        /*!< 0x80000000 */
#define RCC_MP_APB1LPENSETR_MDIOSLPEN             RCC_MP_APB1LPENSETR_MDIOSLPEN_Msk                  /*!< MDIOS peripheral clocks enable during CSleep mode */

